{"word": "Aduh", "description": "Aduh\n\nPronunciation: ah-doo\n\nAlternate spellings: Ahduh, adoh\n\nDefinition:\nAduh is an interjection commonly used in Singlish to express surprise, frustration, pain, or exasperation. It is versatile and can be used in various situations to convey different emotions. The intensity and tone with which it is uttered can vary depending on the context.\n\nExample:\n\n1. \"Aduh, I missed the bus again!\"\n   (expressing frustration and disappointment)\n\n2. \"Aduh! That hurt!\"\n   (expressing pain or surprise)\n\n3. \"Aduh, how can you say that?\"\n   (expressing disbelief or exasperation)\n\n4. \"Aduh, why so hot lah!\"\n   (expressing the feeling of discomfort)\n\nUsage notes:\n- Aduh is often elongated for emphasis, like \"Adoooooh!\" or \"Aduuuuh!\"\n- This exclamation is commonly heard and used in Singapore and among the local ethnic communities.\n- Aduh is similar to the English interjections \"oh no,\" \"ouch,\" or \"geeze.\"\n\nRelated terms:\n- Aiyah: an interjection expressing resignation or mild annoyance\n- Alamak: an interjection expressing surprise or disappointment\n\nNote: Singlish, short for Singaporean English, refers to the unique creole language spoken in Singapore, which incorporates elements of English, Mandarin Chinese, Malay, Tamil, and various Chinese dialects."}
{"word": "duku langsat", "description": "Title: Duku Langsat\n\nWord: Duku Langsat\nPronunciation: \"doo-koo lang-saat\"\nAlternate Spellings: Duku Langsat (no alternate spellings)\n\nDefinition:\nDuku Langsat refers to a small tropical fruit that is native to Southeast Asia, specifically Malaysia and Indonesia. It belongs to the Meliaceae family and is botanically known as Lansium parasiticum. The fruit has a round to oval shape, with a thin, smooth, and greenish-yellow skin that is easy to peel. Inside, it houses several segments of translucent, juicy, and sweet pulp, each holding a single seed.\n\nDuku Langsat is well-loved for its unique flavor, which is a delightful blend of sweetness and slight tanginess. Its taste is often compared to a combination of lychee and grape flavors. The fruit is typically consumed fresh, either on its own or as an ingredient in various dishes and desserts. It can also be found in canned or preserved forms.\n\nUsed in a sentence:\n1. \"Let's buy some duku langsat from the market and enjoy them as a refreshing snack.\"\n2. \"I love the sweet and juicy pulp of duku langsat – it's like little bursts of tropical delight in my mouth!\"\n\nNotes:\nDuku Langsat is often confused with another similar fruit known as \"Langsat.\" While both fruits belong to the same family, the primary difference lies in their appearance. Langsat fruit has a thin yellow skin, as opposed to the greenish-yellow skin of Duku Langsat. Therefore, it's important to differentiate between the two to avoid any confusion."}
{"word": "Archar", "description": "Archar\n(ah-cha)\nAlternate spelling: Ahchar, Achar\n\nDefinition:\nArchar refers to a popular tangy and spicy pickled relish commonly found in Singaporean and Malaysian cuisine. It is typically made by pickling vegetables such as cucumbers, carrots, and cabbage in a mixture of vinegar, spices, sugar, and sometimes tamarind pulp. Archar is often enjoyed as a condiment or side dish to add a burst of flavors to a meal.\n\nExample:\n\"I love having archar with my nasi lemak. It adds a tangy kick to the dish.\"\n\nNote:\nIn Singlish, the word \"archar\" is derived from the Malay word \"acar,\" which translates to \"pickle\" in English. It is commonly used and understood in the local context."}
{"word": "Baluku  (bruise with a bump)", "description": "Baluku (bruise with a bump)\n\nPronunciation: bah-loo-koo\n\nAlternate spellings: Balukoo\n\nDefinition:\nBaluku is a Singlish term used to describe a bruise that is accompanied by a visible and raised bump on the skin. It is derived from Malay, where \"baluku\" refers to a bruise. This term is commonly used in Singapore to describe injuries that result in a swelling or lump along with the discoloration of the skin caused by internal bleeding.\n\nExample:\n\"Ouch! I knocked my knee against the table, and now I have a painful baluku!\"\n\nNote:\nThe term \"baluku\" is typically used in informal conversations and may not be as commonly understood in formal or professional settings."}
{"word": "bukit", "description": "bukit (pronounced boo-kit) is a commonly used Singaporean Singlish term that refers to a hill or elevated area. It is derived from the Malay language, where bukit also means hill. The term is often used to describe various geographic features, both natural and man-made, such as Bukit Timah Nature Reserve or Orchard Road's hilly terrain.\n\nAlternate spellings or variations of this word may include \"bukitt\" or \"buket,\" reflecting the phonetic pronunciation of the word in Singlish.\n\nExample sentences:\n1. \"Let's go for a hike up Bukit Timah.\"\n2. \"I live in a condominium on top of a bukit.\"\n3. \"It's quite a challenge cycling up the steep bukets in the area.\"\n\nPlease note that while \"bukit\" is widely understood in Singapore, it may not be universally recognized or used in other English-speaking communities."}
{"word": "Bai-bai", "description": "Word: Bai-bai\n\nPronunciation: bye-bye (bahy-bahy)\n\nAlternate Spellings: Bye-bye, Bai bai, Bye bye\n\nDefinition:\n1. (Interjection) Used to bid farewell or take leave, derived from the English phrase \"bye-bye.\" It is commonly used in Singlish as a more informal, casual way of saying goodbye to someone.\n\nExample:\n- A: \"I have to go now, see you later!\"\n- B: \"Bai-bai! Take care!\"\n\nNotes:\nThe term 'bai-bai' retains the same meaning and usage as its English equivalent 'bye-bye,' but it is often employed within the context of Singlish conversation to add a local touch. It is commonly used among friends, family members, or acquaintances in informal settings, and conveys a sense of warmth and familiarity."}
{"word": "Gu ji", "description": "Word: Gu ji\nPronunciation: goo-jee\nAlternate spellings: gao ji\n\nDefinition:\nGu ji is a Singlish term derived from the Hokkien dialect, commonly used in Singapore. It is used to describe someone who is overly enthusiastic or excessively eager, often to the point of being obnoxious or annoying. The term can be used to refer to a person's behavior, attitude, or actions.\n\nExample:\nJenny: \"Did you see how Andrew was acting during the game? He was cheering so loudly and jumping up and down like crazy!\"\nAmy: \"Yeah, he's such a gu ji.\"\n\nNote: The term 'gu ji' is typically used in a lighthearted and somewhat humorous manner to tease or mock someone who is being excessively enthusiastic. However, it is important to use it with tact and in appropriate settings to avoid causing offense."}
{"word": "Ah-doay", "description": "Ah-doay\n\nPronunciation: /a-doh-ay/\n\nAlternate spellings: Ahdoay, ahdohay, ahdoi\n\nDefinition:\nAh-doay is a colloquial term commonly used in Singlish, which combines the English words \"ah\" and \"doay.\" It is an interjection that expresses surprise, disbelief, or astonishment. This word is typically uttered with an upward inflection at the end, emphasizing the speaker's incredulity or shock.\n\nExample:\nPerson A: \"I just won the lottery!\"\nPerson B: \"Ah-doay! Seriously? That's amazing!\"\n\nUsage:\n1. Used to convey disbelief or astonishment.\n2. Can be used to question the veracity or truthfulness of a statement or claim.\n\nNote: \n- The pronunciation of \"ah\" in Singlish often includes a shortening of the vowel sound, resulting in an abrupt and clipped \"a\" sound. \n- The spelling of \"doay\" may vary slightly due to the unique phonetic characteristics of Singlish. However, the meaning remains the same across different spellings."}
{"word": "Bak ku teh", "description": "Dictionary Entry: Bak Ku Teh\n\nWord: Bak Ku Teh / Bah Ku Teh\nPronunciation: /bah-koo-teh/\n\nAlternative Spellings: Bah Kut Teh\n\nDefinition:\nBak Ku Teh, also known as Bah Ku Teh, is a popular dish in Singaporean and Malaysian cuisine. The term \"Bak Ku Teh\" roughly translates to \"meat bone tea\" in English. It is a flavorful and aromatic soup that consists of pork ribs simmered in a mix of herbs, spices, and various medicinal ingredients. The dish is often served with a side of rice or noodles.\n\nUsage:\n1. \"Let's go for a hearty bowl of Bak Ku Teh for lunch.\"\n2. \"Where can I find the best Bak Ku Teh in town?\"\n\nOrigin:\nBak Ku Teh has its origins in the Hokkien dialect, spoken by the Chinese community in Singapore and Malaysia. \"Bak\" refers to meat, \"Ku\" means bone, and \"Teh\" refers to tea. The name implies that the soup is brewed like tea and contains various meat and bone components, which infuse the broth with a rich and complex flavor.\n\nCultural Significance:\nBak Ku Teh has become a beloved dish in Singapore and Malaysia, with numerous stalls, eateries, and restaurants specializing in its preparation. It is often enjoyed as a comforting meal, especially during cooler months. The dish is renowned for its herbal infusion, tender pork ribs, and the harmony of flavors produced when the spiced broth is paired with side dishes like braised tofu, mushrooms, and vegetables.\n\nNote:\nDue to its popularity, Bak Ku Teh is also sometimes known as \"Hainanese Bak Ku Teh\" or \"Teochew Bak Ku Teh,\" as different dialect groups have added their own variations to the recipe over time."}
{"word": "Baju", "description": "Entry: Baju (noun)\n\nPronunciation: bah-joo\n\nAlternate spellings: Bajoo, bajou, bajew\n\nDefinition:\nBaju is a Malay loanword commonly used in Singlish to refer to a piece of clothing, specifically a traditional Malay or Indonesian garment. It typically refers to a loose-fitting shirt or blouse worn by both men and women, often with long sleeves and a collar. The term 'baju' is used to describe various traditional attire such as the baju kurung, baju melayu, or baju kebaya. In Singlish, it is also occasionally used to describe any casual or loose-fitting top.\n\nExample sentences:\n1. \"Eh, I love your baju kebaya. It looks so elegant!\"\n2. \"Cannot find my baju to wear for the party. I think I need to do laundry lah.\"\n\nNote: Baju is one of many borrowed Malay words that have been incorporated into the Singaporean English vocabulary, reflecting the multicultural and multilingual nature of Singapore society."}
{"word": "Chou chou", "description": "Word: Chou chou\nPronunciation: choo choo\nAlternate Spellings: choo choo\n\nDefinition:\nChou chou is a popular Singlish expression derived from Hokkien, a dialect spoken in Singapore. It is an affectionate term often used to describe something cute, endearing, adorable or charming. It is similar to the English term \"cutie\" or \"sweetie\".\n\nUsage:\n1. That puppy is so chou chou! I can't resist cuddling it.\n2. Look at this chou chou little baby! Isn't she precious?\n3. Aww, your drawings are always chou chou lah!\n\nNote:\nThe use of \"chou chou\" is commonly accompanied by a sing-song tone, emphasizing the affectionate nature of the term. It is frequently used when referring to babies, animals, or anything small and delightful."}
{"word": "Bantal busuk", "description": "Title: Bantal Busuk\n\nPronunciation: BAHN-tahl BOO-sook\n\nAlternate spellings: Bantal Busok\n\nDefinition:\nBantal busuk is a Malay term widely used in Singapore and Malaysia, primarily in the Singlish dialect. The term 'bantal' means pillow, while 'busuk' translates to smelly or foul. When combined, 'bantal busuk' refers to a pillow that emits an unpleasant odor. However, within Singlish, the term has evolved to encompass a deeper meaning beyond its literal translation.\n\nUsage:\n1. My bantal busuk still smells even after washing it several times.\n2. Don't forget to air out your bantal busuk regularly to prevent it from smelling worse.\n3. My roommate's bantal busuk is so bad that it can clear a room.\n\nExplanation:\nThe phrase 'bantal busuk' is often used humorously or affectionately to describe a well-loved or worn-out pillow, despite its odor. It has become a term of endearment or nostalgia, symbolizing comfort or familiarity to some individuals. The phrase holds a sentimental value, especially when referring to a pillow that has been used for many years, despite the unpleasant smell.\n\nHowever, it is important to note that 'bantal busuk' can be subjective, and what one person finds unpleasant, another may not. Therefore, the term can also be used to describe anything that has a lingering, undesirable smell or an item that evokes nostalgia despite being visually unattractive.\n\nPlease note that 'bantal busuk,' being a term from the Singlish dialect, may not be widely understood outside of Singapore and Malaysia, where English is primarily spoken."}
{"word": "Adik", "description": "Entry: Adik\n\nPronunciation: ah-dik\n\nAlternate spellings: \n\n- Adik (no alternate spelling)\n\nDefinition: \n\nAdik is a colloquial term derived from the Hokkien dialect, commonly used in Singlish to refer to a younger sibling or a younger person, regardless of their actual familial relationship. This term is often used as a form of endearment or to show familiarity and closeness.\n\nExample sentences:\n\n1. \"Eh, adik, come here and help me with this!\"\n\n2. \"My adik always follows me around everywhere I go.\"\n\n3. \"She's like my adik, always seeking my advice.\"\n\nNote: The usage of \"adik\" to address a younger person may not necessarily indicate an actual blood relation, but rather a way of showing affection or camaraderie."}
{"word": "Alah", "description": "Alah (ah-lah)\n\nPronunciation: /ɑːlɑː/ or /ɑːlə/\n\nAlternate spellings: Ah lah\n\nDefinition:\nAlah is a frequently used interjection in the Singlish language, derived from the Malay word \"Allah,\" which means God. It is an expression used to display a range of emotions such as surprise, disappointment, or frustration. The versatility of \"alah\" allows it to be used in various contexts with different meanings, making it a fundamental element of Singlish.\n\nExample:\n1. Surprise: \"Alah! You won the lottery? Wah, so lucky!\"\n2. Disappointment: \"I thought my food delivery was here, but it was just a text message. Alah.\"\n3. Frustration: \"Alah, the bus left just as I reached the bus stop!\"\n\nCultural Significance:\n\"Alah\" reflects the multicultural influences in Singapore, with its origin in Malay. It has become an integral part of Singlish, bridging cultural divides and unifying people from different backgrounds. The distinctiveness and familiarity of \"alah\" contribute to its widespread usage and recognition among Singaporeans.\n\nUsage Notes:\n1. \"Alah\" can be used alone as an interjection or combined with other words to form phrases.\n2. In informal settings, \"alah\" can also be elongated to \"alaahhhh\" for added emphasis or exaggeration.\n3. It is important to note that this interjection, while accepted and widely used in Singapore, may not be suitable for formal contexts.\n\nNote: Singlish is a blend of English, Malay, Chinese, Tamil, and other local dialects, which shapes the linguistic landscape of Singapore."}
{"word": "Oh peh som", "description": "Word: Oh peh som\n\nPronunciation: Oh peh sohm\n\nAlternate spellings: Oh pei som, Oh peh sum\n\nDefinition:\nOh peh som is a Singlish phrase commonly used in Singapore to describe something that is excessively overwhelming or mind-boggling. It is derived from a combination of the Hokkien dialect word \"oh peh\" (which means to overpower or overwhelm) and the colloquial English word \"some\" (meaning a significant amount or intensity).\n\nExample:\nPerson A: \"Did you see the crazy traffic jam during peak hour?\"\nPerson B: \"Yeah, it was oh peh som lah! I was stuck for hours.\"\n\nUsage:\n- Used to emphasize the extreme nature of a situation or event.\n- Typically used in informal conversations among friends or family.\n\nNote:\nSinglish is a localized form of English language spoken in Singapore, incorporating influences from various local languages and dialects, including Hokkien, Malay, and Tamil."}
{"word": "Lom chiam pas", "description": "Word: Lom chiam pas\nPronunciation: lohm chee-uhm pahs\nAlternate spellings: Lom chiam pass\n\nDefinition:\nLom chiam pas is a Singlish phrase derived from Hokkien dialect and commonly used in Singapore. It is used to describe someone who is reluctant, unwilling, or hesitant in taking up responsibilities or doing something that requires effort or commitment. The phrase implies a lack of enthusiasm or determination.\n\nExample:\nJohn is known for being lom chiam pas whenever it comes to volunteering for community events.\n\nOrigin:\nThe phrase \"lom chiam pas\" originates from the Hokkien words \"lom\" meaning reluctant or unwilling, \"chiam\" meaning participate or involved, and \"pas\" meaning refuse or reject. The phrase has been adopted into Singlish over the years and is commonly used to describe someone's behavior or attitude.\n\nUsage:\n1. Don't ask David to come along for hiking, he is always lom chiam pas about outdoor activities.\n2. Mary was lom chiam pas about taking on the new project at work, but with some encouragement, she finally agreed.\n\nNote: This phrase has a slightly negative connotation, implying a lack of motivation or enthusiasm. It is important to use it in an appropriate context."}
{"word": "bang", "description": "Title: Bang\n\nDefinition:\nIn Singlish, the term \"bang\" is an onomatopoeic word used to describe a loud noise or a sudden impact. It is commonly used to convey the intense sound created by an explosion, collision, or a forceful action.\n\nPronunciation: \n/bæŋ/ (bang)\n\nAlternate Spellings: \nNone\n\nExample Sentences:\n1. \"Did you hear that loud bang? I think something crashed outside.\"\n2. \"The fireworks display ended with a bang, stunning everyone attending the event.\"\n3. \"I accidentally bumped into the table, and it made a loud bang.\"\n\nUsage Notes:\n- The term \"bang\" is typically associated with describing loud and sudden noises caused by various activities or events.\n- It is essential to consider the context in which \"bang\" is used, as it can refer to both actual sounds and figurative situations.\n- This term can be used as both a noun and a verb in Singlish conversations. For example, \"There was a loud bang when the door closed\" (noun usage), or \"He banged the door shut angrily\" (verb usage).\n\nRelated Terms:\n1. Boom: Refers to a loud, deep sound associated with an explosion or a resonating impact, sometimes used interchangeably with \"bang\" in Singlish.\n2. Clang: Describes a loud, metallic sound produced by the collision of objects, similar in context to \"bang.\"\n3. Kapow: A playful term used to mimic a sound effect, commonly used in comics or cartoons to describe a sudden explosion or impact.\n\nNote: Singlish, short for Singapore English, is a colloquial form of English widely spoken in Singapore. It incorporates words and phrases from various languages spoken in Singapore, including Malay, Mandarin Chinese, and Tamil, among others."}
{"word": "Bee hoon", "description": "Title: Bee hoon\n\nPronunciation: Bee hoon (bee-hoon)\n\nAlternate Spellings: Beehoon, bhi hoon, bihun (used in Malaysia)\n\nDefinition:\nBee hoon is a popular term in Singlish and refers to a type of thin rice noodles commonly used in a variety of traditional Singaporean and Asian dishes. The term 'bee hoon' is derived from the Hokkien dialect, which is widely spoken in Singapore. It is often spelled as one word: Beehoon.\n\nUsage:\n1. Did you try the mee goreng with bee hoon at the hawker center? It's delicious!\n2. I'm craving for some bee hoon soup for dinner tonight.\n3. Let's make a stir-fry with bee hoon and vegetables.\n\nExplanation:\nBee hoon, also known as rice vermicelli, is made from rice flour, water, and sometimes starch. It has a translucent appearance and a delicate texture. This noodle variety comes in different thicknesses, such as thin, medium, and thick bee hoon. Bee hoon is often soaked in water before being cooked and is used in a wide range of dishes, including fried bee hoon, bee hoon soup, bee hoon soto, and bee hoon stir-fry.\n\nIn Singaporean cuisine, bee hoon is a versatile ingredient and is commonly found in popular local dishes like Singapore-style fried bee hoon, which is stir-fried with various vegetables, thinly sliced meat, and often seasoned with soy sauce or curry powder. It is also commonly used in laksa, a spicy noodle soup, where the bee hoon soaks up the rich and fragrant coconut-based broth.\n\nIn Malaysian cuisine, particularly in Malay, Chinese, and Nyonya cuisines, bee hoon is equally treasured and used in dishes like bihun goreng (fried bee hoon), bee hoon soup, and soto bihun (bee hoon soup with spices).\n\nOverall, bee hoon is an essential ingredient in Singaporean and Malaysian culinary traditions, and its delectable taste and versatility have made it a beloved staple in many local dishes."}
{"word": "Chukop", "description": "Title: Chukop\n\nPronunciation: choo-kop\n\nAlternate spelling: Chope\n\nDefinition:\nChukop is a colloquial term widely used in Singlish to express the act of reserving or saving a seat or spot for oneself or others. It is derived from the Hokkien dialect word \"chho̍h-khò\" which means \"to claim\" or \"to mark.\" \n\nUsage:\n1. \"I chukop this seat for you, so don't worry.\"\nTranslation: \"I have reserved this seat for you, so don't worry.\"\n\n2. \"You better chukop seats early if you want a good view.\"\nTranslation: \"You should reserve seats early if you want a good view.\"\n\n3. \"I chukop bao* here already, don't steal ah!\"\nTranslation: \"I have already claimed this spot, don't take it!\"\n\n*Note: \"Bao\" is a Hokkien slang term referring to a place, spot, or territory.\n\nAdditional Information:\nThe act of chukop is commonly seen in places like hawker centers, food courts, cinemas, or public transportation where people may want to secure a specific seat or a desirable spot. It is typically accomplished by placing personal belongings (such as a tissue packet, umbrella, or a bag) on the desired seat or spot as a visible sign that it has been claimed. Chukop is deeply ingrained in Singaporean culture and is often seen as a practical way of ensuring one's personal space or reserving seats for friends or family members."}
{"word": "Ah boy", "description": "Ah boy\n\nPronunciation: /ɑː bɔɪ/\n\nAlternate spellings: Ah boi, Ahbuay\n\nDefinition:\nAh boy is a common term used in Singlish to refer to a young boy or a young man. It is often used affectionately and is commonly heard in daily conversations amongst Singaporeans. The term is a fusion of the Chinese word \"ah\" (meaning \"little\" or \"hey\") and the English word \"boy\". \n\nExample:\n1. \"Eh, see that ah boy, so cheeky one!\"\n2. \"Ah boy, go buy some kopi for me, please.\"\n\nUsage notes:\n- The term \"ah boy\" can be used irrespective of the age of the person being referred to. It can refer to a boy or young man from childhood to early adulthood.\n- Sometimes, \"ah boy\" can also be used to refer to someone in a friendly or familiar manner even if they are not actually young in age.\n\nOrigin:\nThe term \"ah boy\" is believed to have originated from the Hokkien Chinese dialect, which is widely spoken in Singapore. Over time, it has become a part of the distinct Singlish language and is used by various ethnic groups in Singapore.\n\nSimilar Terms:\n- Buey tahan (pronounced: /bʊeɪ tɑː hɑːn/): This term is also commonly used in Singlish and means \"cannot tolerate\" or \"cannot stand.\" It can be used to describe someone's behavior or actions."}
{"word": "Belachan", "description": "Belachan (pronounced buh-lah-chan) is a Malay loanword commonly used in Singlish. It refers to a pungent shrimp paste that is widely used in Southeast Asian cuisine, particularly in dishes from Malaysia, Singapore, and Indonesia.\n\nAlternate Spellings: Blachan, belacan\n\nBelachan is made from fermented ground shrimp mixed with salt and is typically sun-dried into small blocks or thick sheets. It has a distinctive aroma and adds a depth of flavor to various traditional dishes, such as sambal belachan, which is a popular chili paste, and laksa, a spicy noodle soup.\n\nThe usage of belachan in Singlish is not limited to just culinary descriptions. It is often used metaphorically to describe someone or something with a strong and overpowering presence. For example, one might say, \"He's like belachan, always making himself the center of attention.\"\n\nIn Singlish, it is not uncommon to hear individuals pronouncing the word as \"bel-chan\" or \"bela-chaan.\" However, the correct pronunciation follows the Malay pronunciation mentioned earlier.\n\nOverall, belachan is an essential ingredient in Southeast Asian cooking and has made its way into Singlish vocabulary to depict both its culinary and metaphorical characteristics."}
{"word": "Orh cheh", "description": "Title: Orh Cheh\n\nWord type: Interjection\n\nPronunciation: Orh cheh (aw-chay)\n\nAlternate spellings: Orh chay, Orh cher, Orh chey\n\nDefinition:\nOrh cheh is a commonly used interjection in Singlish, derived from the Hokkien dialect. It is typically used to express disbelief, surprise, or skepticism. The tone used while saying 'Orh cheh' can be playful, mocking, or sarcastic, depending on the context.\n\nExample sentences:\n1. \"You think you can eat ten plates of chicken rice? Orh cheh, don't bluff lah!\"\n2. \"Orh cheh, don't pretend you don't know! I saw you at the shopping mall yesterday.\"\n\nUsage notes:\n- Orh cheh is often used to challenge or question the truthfulness, feasibility, or credibility of a statement or claim made by another person.\n- When used in a lighthearted manner among friends, it is considered playful banter.\n- This term can be combined with other Singlish interjections, such as \"Orh cheh boh\" (expressing uncertainty or doubt) or \"Orh cheh lah\" (expressing annoyance or frustration).\n\nOrigins:\nThe phrase 'Orh cheh' is derived from the Hokkien dialect, where 'orh' means 'oh' or 'to verify' and 'cheh' means 'elder sister.' The combination of these words creates an interjection that is unique to Singlish and widely understood by the local population.\n\nSimilar phrases:\n1. Alamak: An expression of surprise or exasperation.\n2. Wah lau: An expression of frustration or disbelief.\n\nNote:\nSinglish is an informal language variety that is commonly spoken in Singapore. While widely used in informal settings, it is important to be aware of appropriate contexts when using Singlish in more formal or professional situations."}
{"word": "Tong tong", "description": "Dictionary Entry: TONG TONG\n\nPronunciation: tawng tawng\n\nAlternate Spellings: tang tang, tong tong, tang tang, thong thong\n\nDefinition:\nTong tong is a versatile Singlish expression that can be used in various contexts. It is predominantly used as an onomatopoeic term to mimic the sound of a bell or chime. However, it is also employed as a colloquial phrase to describe the idea of something being tidy, organized, or in order.\n\nExample Usages:\n\n1. Onomatopoeic Usage:\n   \"I heard the tong tong of the ice cream truck approaching our neighborhood.\"\n   In this context, tong tong refers to the delightful sound of a bell or chime used by an ice cream truck to attract customers.\n\n2. Descriptive Usage:\n   \"Your room is so tong tong, everything is in its place!\"\n   Here, tong tong is used to denote that the room is neat, tidy, and well-organized.\n\n3. Expressive Usage:\n   \"Finally finished cleaning the house! Now it's all tong tong!\"\n   In this example, tong tong is used to express satisfaction and contentment upon completing a task and achieving a state of cleanliness and order.\n\nAdditional Notes:\nTong tong is a versatile term that can be used in both spoken and written Singlish, adding a touch of local flavor to conversations. It is often accompanied by appropriate hand gestures to enhance its meaning, particularly when used in the context of imitating the sound of a bell or chime."}
{"word": "Ah girl", "description": "Ah girl\n\nPronunciation: /ɑː gɜːl/\n\nAlternate spellings: Ah gurl\n\nDefinition:\nAh girl is a term commonly used in Singapore to refer to a young woman or girl, typically in her teenage years or early adulthood. It is derived from the local colloquial usage of \"ah\" as a term of address, often used to show familiarity or affection. The term is mainly used within the Singlish (Singaporean English) community.\n\nExample 1:\n\"Hey, ah girl, want to join us for dinner tonight?\"\n\nExample 2:\n\"Ah girl, where are you going with your friends?\"\n\nIn the above examples, \"ah girl\" is used as a form of address to a young woman or girl. It adds a sense of familiarity and friendliness to the conversation and can be seen as an endearing term.\n\nNote: The term \"ah girl\" is not to be confused with \"ah lian,\" which is specifically used to describe a young woman who is perceived as being loud, brash, and flashy."}
{"word": "Already", "description": "Title: Already\n\nWord Type: Adverb\n\nPronunciation: /ɔːlˈrɛdi/ \n\nAlternate Spellings: Ahl-ready, Oredi, O'ledi\n\nDefinition:\n'Already' is a versatile and commonly used adverb in Singlish. It is borrowed from the English language but has adapted a distinct meaning and usage in Singaporean English. It is used to convey the notion of completed action or the fact that something has occurred earlier than expected.\n\nExample Sentences:\n1. \"I told you already, no need to remind me again.\" \n2. \"He went to the store already, but forgot to buy the milk.\"\n3. \"Aiyah, don't need to rush, the bus already gone.\"\n\nUsage Notes:\n1. 'Already' is often placed at the end of a sentence or phrase, emphasizing the completion or prior occurrence of an action.\n2. In informal contexts, 'already' may be shortened to \"olor\" or \"odi,\" both of which retain the same meaning. For example, \"He went home odi\" or \"I finished eating odi.\"\n3. 'Already' can also be used to express impatience, frustration, or annoyance, depending on the context and tone of the speaker. In such cases, it may be emphasized or elongated, for example, \"Alr-r-r-ready lah, why you keep asking?\"\n\nAdditional Information:\n1. 'Already' is a versatile term, and its meaning can vary depending on the context, tone, and intonation used.\n2. Singlish speakers often use 'already' as a response instead of directly replying to a question, indicating that they have understood or taken action.\n\nRelated Words:\n1. 'Abit' - Short for 'a bit,' indicating a small quantity or an amount that is not particularly significant.\n2. 'Can' - A versatile term used to express agreement, permission, or the ability to perform an action.\n3. 'Liao' - Meaning 'already' or 'finished,' this term emphasizes the completion of a task or the occurrence of a certain event.\n\nPlease let me know if you need further assistance!"}
{"word": "Ah gong", "description": "Ah gong (Ah-gong)\nPronunciation: /ɑː ɡɔŋ/\nAlternate spellings: Ar gong, Ah gung, Ah geng\n\nDefinition:\nAh gong is a term commonly used in Singlish to refer to one's paternal grandfather or elderly male figure. The word \"ah\" is an affectionate term used to address someone who is older or respected, while \"gong\" is a Chinese word which means \"grandfather.\" Therefore, \"ah gong\" is a term of endearment used by Singaporeans to show respect and affection for their paternal grandfather.\n\nExample:\n- Ah gong, can you tell us a story about your childhood?\n- I love spending time with my ah gong at the coffee shop. He has the best stories to share!\n\nNote:\nWhile \"ah gong\" is predominantly used to refer to one's paternal grandfather, in some instances, it may be used more broadly to address an elderly male figure who is not necessarily a direct relative. Additionally, alternate spellings such as \"Ar gong,\" \"Ah gung,\" or \"Ah geng\" may be used to portray different regional dialect influences or personal preferences."}
{"word": "Gam", "description": "Gam \n\nPronunciation: /gahm/ \n\nAlternate spellings: Gahm, gum\n\nDefinition:\nGam is a Singlish term derived from Hokkien, a Chinese dialect widely spoken in Singapore. It is commonly used as a verb to mean \"to hang out,\" \"to chill,\" or \"to spend time together with friends or family.\" It is often used in informal conversations and can refer to any casual gathering, ranging from catching up over a meal, watching a movie, or simply relaxing together. \n\nExample:\n\n1. \"Hey, let's gam at my place this weekend! We can order some pizza and play video games.\"\n\n2. \"Ah boy, don't just stay at home. Go gam with your friends, lah!\"\n\n3. \"After a tiring week, I just want to gam with my family by the beach and enjoy the sunset.\"\n\nNote: The word \"gam\" is commonly used in Singlish and may also be heard in other Southeast Asian countries with Chinese communities."}
{"word": "Gai gai", "description": "Word: Gai gai\n\nPronunciation: [gai gai]\n\nAlternate Spellings: Gai-gai, GaiGai\n\nDefinition:\nGai gai is a Singlish phrase derived from the Hokkien and Malay language that is commonly used in Singapore. This informal expression refers to the act of going out or socializing for leisure and entertainment purposes. It can be used as a verb or noun, depending on the context.\n\nExample Usage:\n1. Verb: \"Let's gai gai at the shopping mall this weekend.\"\n2. Noun: \"I enjoy going for a gai gai with my friends.\"\n\nIn essence, gai gai refers to exploring or visiting various establishments such as malls, parks, restaurants, or any other leisure spots to have a good time. It often conveys a sense of relaxation, enjoyment, and a break from routine activities."}
{"word": "Mamak", "description": "Word: Mamak\nPronunciation: /ma-mak/\nAlternate Spellings: Mamak\n\nDefinition:\nMamak is a term commonly used in Singapore to refer to Indian-Muslim food establishments. It stems from the Tamil word \"mama\" which means uncle or respected elder. Mamak outlets are typically casual eateries that serve affordable and delicious halal food, becoming a popular spot for locals to enjoy a variety of Indian and Malay cuisine.\n\nExample:\n\"I'm craving roti canai for breakfast. Let's head to the mamak stall nearby.\"\n\nNote:\nThe term \"mamak\" can also be used to refer to Indian-Muslim individuals, particularly those who own or work in these establishments. In this context, it is important to use the term respectfully and with sensitivity."}
{"word": "Mama shop", "description": "Word: Mama shop\n\nPronunciation: mah-mah shop\n\nAlternate spellings: Mama shop, mama shoppe\n\nDefinition:\nNoun:\n1. A small, cozy convenience store found in local neighborhoods in Singapore, typically run by Indian or Chinese families. \n2. A colloquial term for a local neighborhood store that sells various daily necessities, snacks, drinks, and other small items. \n\nExample:\n1. My friend lives near a mama shop, so we always go there to buy our evening snacks.\n2. Let's stop by the mama shop to grab some drinks before heading to the park.\n\nNote: The term \"mama shop\" is derived from the Malay word \"mama,\" meaning \"uncle.\" These shops are also commonly referred to as \"uncle shop\" or \"uncle store\" in Singlish, as a way to address the shopkeeper respectfully."}
{"word": "Hijab", "description": "Title: Hijab (hee-jab)\n\nDefinition:\nHijab, pronounced as \"hee-jab,\" is a term borrowed from the Arabic language, commonly used in Singapore to refer to a specific type of modest clothing worn by Muslim women. The word 'hijab' is often used interchangeably with the Malay word 'tudung', but it more specifically refers to the headscarf that covers the hair, neck, and sometimes the shoulders. The Hijab is an essential part of Islamic dress for observant Muslim women, symbolizing the concept of modesty, privacy, and the religious beliefs of the individual.\n\nAlternate spellings: None.\n\nExample Usage:\n1. \"She looks elegant in her hijab.\"\n2. \"Are you wearing a hijab today?\"\n3. \"I forgot to bring my hijab; can I borrow yours?\"\n\nNote: The term 'hijab' is a widely recognized term globally and does not have alternative spellings in the Singlish context. However, within specific Muslim cultural contexts in Singapore, alternative terms like 'tudung' or 'tudung hijab' may also be used to describe the same concept."}
{"word": "Tudung", "description": "Tudung [too-dung] (Alternate spellings: tudong)\n\nPronunciation:\n\n- Too-dung (Standard English)\n- Too-dong (Colloquial Singlish)\n\nDefinition:\n\nNoun\n\n1. A traditional headscarf worn by Muslim women as a form of modesty covering the hair, neck, and shoulders. The tudung is often worn as a religious and cultural symbol, representing piety and identity.\n\nUsage:\n\n1. She looked elegant in her colorful tudung.\n2. Sarah always wears her tudung when she goes to the mosque.\n3. Do you know where I can find a beautiful tudong for my sister's wedding?\n\nOrigin:\n\nMalay language - \"tudung\", meaning \"veil\" or \"headscarf\".\n\nNote:\n\nThe word \"tudung\" is commonly used in Singapore to refer to a Muslim woman's headscarf. It is important to approach this term with cultural sensitivity and respect for religious practices."}
{"word": "Popo", "description": "Word: Popo\n\nPronunciation: poh-poh\n\nAlternate Spelling: Ah Ma\n\nDefinition:\nPopo is a term derived from Hokkien, a Chinese dialect widely spoken in Singapore. It is an endearing term used to refer to one's paternal or maternal grandmother. Popo is commonly used in Singlish to affectionately address or talk about one's grandmother.\n\nExample:\n1. \"My popo loves to cook delicious meals for the whole family.\"\n2. \"I'm going to visit my popo this weekend. She always has a bunch of stories to tell.\"\n\nUsage Note:\nThe term \"Popo\" is often used interchangeably with the term \"Ah Ma,\" which is a Mandarin Chinese term for grandmother. Both terms are widely understood and recognized in Singaporean culture."}
{"word": "Ah ma", "description": "Ah ma\n\nPronunciation: /ah mah/\n\nAlternate spellings: Ahmah, Ahma\n\nDefinition:\nAh ma is a term commonly used in the Singlish dialect to refer to one's maternal grandmother. This term is derived from the Hokkien language, where \"ah\" is used as a term of endearment or respect, and \"ma\" refers to mother. It is used to affectionately address or mention one's grandmother on the mother's side.\n\nExample:\n1. \"Ah ma, can I have some kaya toast for breakfast?\"\n2. \"I'm going over to Ah ma's place for dinner tonight.\"\n3. \"Ahma always tells the best stories from her childhood.\"\n\nNote: Ah ma can also be used more generally to refer to elderly women as a sign of respect, similar to the English term \"aunty.\" However, it is more commonly used to specifically address one's maternal grandmother."}
{"word": "Hentam", "description": "Hentam\n\nPronunciation: hen-tahm\n\nAlternate Spellings: -\n\nDefinition:\nHentam is a Singlish slang term borrowed from the Malay language. It is commonly used in Singapore to describe an action of doing something without much thought or planning, often with a sense of recklessness or spontaneity. The word can also be used to express a carefree or go-with-the-flow attitude towards a situation. \n\nExample:\n1. \"I didn't study for the test, so I just hentam and see how it goes.\"\nTranslation: \"I didn't study for the test, so I just wing it and see how it goes.\"\n\n2. \"He decided to hentam and book a last-minute flight to Bali.\"\nTranslation: \"He decided to impulsively book a last-minute flight to Bali.\"\n\n3. \"Don't need to stress so much, just hentam and do it lah.\"\nTranslation: \"Don't worry too much, just go with the flow and do it.\"\n\nNote: Hentam is often used in casual speech and might not be appropriate in formal or professional settings."}
{"word": "Ah peh", "description": "Word: Ah peh\n\nPart of Speech: Noun\n\nPronunciation: ah-peh\n\nAlternate Spellings: Ah Peh\n\nDefinition:\nAh peh is a Singlish term used to refer to an older male family member or friend. It is derived from the Hokkien dialect, where \"Ah\" is a term of respect for elders, and \"peh\" means uncle. The term is commonly used in Singapore to show familiarity, affection, or respect towards an older male figure.\n\nExample sentences:\n1. \"Ah peh, can you help me fix this bicycle tire?\"\n2. \"My Ah peh always tells the best stories about his childhood.\"\n3. \"Ah peh, how have you been? It's been a while since we last met.\"\n\nUsage notes:\n- Ah peh is usually used when addressing male relatives or family friends who are significantly older in age.\n- The term is most commonly used within the Chinese Singaporean community, especially among those who speak Hokkien.\n- It is considered polite to use \"Ah\" before the person's name to denote respect or familiarity when addressing an Ah peh.\n\nRelated terms:\n1. Ah ma: Refers to an older female family member or friend, usually translated as \"grandmother\" or \"granny.\"\n2. Ah kong: Refers to an older male family member or friend, usually translated as \"grandfather\" or \"grandpa.\"\n\nNote: Singlish is a colloquial, English-based creole language predominantly spoken in Singapore. The dictionary entries aim to provide an understanding of Singlish terms within the local context."}
{"word": "Nangka", "description": "Nangka (næŋ-kah) - Alternate Spellings: Nanggah, Nangkah\n\nDescription:\nNangka is a Singlish term derived from the Malay language, referring to the jackfruit (Artocarpus heterophyllus) fruit. The word Nangka is commonly used in Singapore to denote both the fruit itself as well as dishes or desserts made with jackfruit.\n\nThe Nangka fruit is native to South and Southeast Asia and is known for its large size, spiky green outer skin, and sweet, tropical flavor. Inside the fruit, golden yellow flesh surrounds large seeds, which can also be cooked and eaten.\n\nIn Singlish, the term Nangka can be used to describe the fruit in its raw form or when it is used as an ingredient in various dishes and desserts. The term is often used in conversations about local cuisine and is a popular ingredient in traditional dishes like nangka lemak (jackfruit cooked in coconut milk) and nangka pengat (jackfruit in sweet coconut milk).\n\nExamples:\n1. \"During the durian season, you can often find nangka being sold at the fruit stalls.\"\n2. \"I love the sweet and creamy taste of nangka in desserts like ice kachang.\"\n\nNote: Singlish, or Singaporean English, is a unique English-based creole language that incorporates words, phrases, and grammar from various languages, including Malay, Chinese dialects, and Tamil. Nangka is a perfect example of how Singlish embraces the local cultural diversity found in Singapore."}
{"word": "Jalan jalan", "description": "Word: Jalan jalan (pronounced: jah-lahn jah-lahn)\n\nDefinition:\nJalan jalan is a commonly used Singlish phrase derived from the Malay language, specifically the word \"jalan\" which means \"to walk\" or \"to go\". However, in Singlish, it has taken on a broader meaning to encompass the activity of leisurely strolling, exploring, or going on a casual outing. It is often used to refer to a fun and relaxed outing, typically involving aimless wandering, sightseeing, or shopping.\n\nExample:\n\"Let's go jalan jalan at Orchard Road this weekend and check out the new shops!\"\n\nAlternate spellings:\n- Jalan2 (sometimes used in informal written communication or online chats)"}
{"word": "Anak", "description": "Word: Anak\nPronunciation: Ah-nak\nAlternate Spellings: None\n\nDefinition:\nAnak is a vernacular term predominantly used in Singaporean colloquial English, commonly known as Singlish. It is derived from Malay and is used to refer to a child or offspring in general. This term is often used affectionately and can be used to describe one's own children as well as other people's children.\n\nExample:\n1. \"My anak just started kindergarten this year.\"\n2. \"Look at that cute little anak over there!\"\n\nNote:\nThe term 'anak' is commonly used in Malay-speaking countries and regions such as Singapore, Malaysia, and Indonesia. It is important to note that while Singlish borrows many words from Malay, the pronunciation and usage of these words may have evolved over time to fit the local context."}
{"word": "Makan", "description": "Word: Makan\n\nPronunciation: mah-kan\n\nAlternate spellings: Makang (less common)\n\nMeaning:\nMakan is a commonly used Singlish word derived from the Malay language. It functions as a verb and is used to refer to the act of eating or having a meal. This word is widely used among the Singaporean population and is an integral part of the local culture.\n\nExample sentences:\n1. \"Let's go makan at that famous hawker center.\"\n2. \"I'm feeling hungry, where can we find good makan around here?\"\n3. \"Makan first, talk later lah.\"\n\nAdditional information:\nThe word 'makan' is often used in Singlish to express pleasure or excitement related to food. It can also be used to invite others to join in a meal or to suggest a dining experience as a social activity. Makan is an essential part of Singapore's diverse culinary scene and is deeply ingrained in the nation's food-loving culture."}
{"word": "jialat", "description": "Word: Jialat\nPronunciation: jai-laht\nAlternate spellings: Jialut\n\nDefinition:\nJialat is a Singlish slang term that originated from the Hokkien dialect. It is used to describe a situation or thing that is extremely troublesome, dire, disastrous, or in a state of great difficulty. This word is often used as an expression of exasperation, emphasizing the severity or intensity of a situation.\n\nExample sentences:\n1. \"My car broke down in the middle of nowhere, and I was late for work. Jialat sia!\"\nTranslation: \"My car broke down in the middle of nowhere, and I was late for work. It was really troublesome!\"\n\n2. \"I studied the wrong chapters for the exam, confirm jialat already.\"\nTranslation: \"I studied the wrong chapters for the exam, it's definitely going to be disastrous.\"\n\n3. \"The rain started pouring just as we were about to set up the picnic. Jialat lah, all our food got wet!\"\nTranslation: \"The rain started pouring just as we were about to set up the picnic. It was such a disaster, all our food got wet!\"\n\nUsage note: Jialat is a versatile word that can be used in various contexts to express extreme or unfortunate situations. It is commonly used in informal conversations among friends and family, and is considered informal or casual language.\n\nOrigin: The term \"jialat\" is derived from the Hokkien phrase \"怕不然\" (peng bo luan), which means \"to fear that something might be the case.\" Over time, it evolved and was assimilated into Singlish, taking on the connotation of something being deeply troublesome or disastrous."}
{"word": "Cher", "description": "Word: Cher\nPronunciation: /cher/\nAlternate Spellings: Chur, Chor\n\nDefinition:\nCher is a Singlish slang term derived from the English word \"teacher\". It is commonly used by Singaporeans to refer to a school teacher, specifically addressing the person with respect and familiarity. The term is often accompanied by a person's first name or a specific title, such as \"Miss Cher\" or \"Mr. Cher\", to show respect towards the teacher.\n\nExample:\nStudent 1: \"Hey, Miss Cher! Can I ask you a question?\"\nStudent 2: \"Mr. Chur, can you please explain this concept again?\"\n\nNote:\nThe use of \"Cher\" is considered informal and is typically used among students when addressing their teachers. It is important to note that while it may be accepted within the classroom setting, using this term outside a school environment may not be appropriate or respectful in some cases."}
{"word": "kacau", "description": "Entry: Kacau\n\nPronunciation: kah-chow\n\nAlternate Spellings: Kachau\n\nDescription:\nKacau is a versatile Singlish word that can be used as a verb, adjective, or noun. It is derived from the Malay language and is commonly employed in Singaporean English. The word can have several different meanings depending on the context.\n\n1. Verb:\n- To disturb, bother, or interrupt someone or something. \nExample: \"Please don't kacau me while I'm working.\"\n\n- To mix, stir, or scramble things together.\nExample: \"Kacau the ingredients well before adding them to the sauce.\"\n\n2. Adjective:\n- To describe something that is chaotic, messy, or disorganized.\nExample: \"My room is so kacau right now, I need to clean it up.\"\n\n3. Noun:\n- A person who intentionally causes trouble or disrupts harmony in a situation.\nExample: \"Don't invite him to the party, he's such a kacau!\"\n\nThe word 'kacau' is commonly used in informal conversations in Singapore and is understood by most Singaporeans. It adds a unique local flavor to the English language, allowing speakers to express various degrees of disturbance, chaos, or annoyance."}
{"word": "kaciau", "description": "Word: Kaciau\nDefinition: Kaciau is a Singlish slang term used to describe someone who is overly cautious, timid, or tends to avoid taking risks. It is often used in a lighthearted or teasing manner to poke fun at someone who is overly careful or afraid of making mistakes.\n\nPronunciation: ka-chow\n\nAlternate Spelling(s): Kachiao, Kachau\n\nExample:\n- Don't be such a kaciau la! Just try the new food, it might be good.\n- He's always so kaciau about everything. Just relax and have some fun."}
{"word": "kachiao", "description": "Word: Kachiao (ka-chi-ow)\n\nDefinition:\nKachiao is a colloquial Singlish term derived from Hokkien, a dialect widely spoken in Singapore. This term is commonly used to describe someone or something that is bothersome, annoying, or troublesome. It can be used to express frustration or irritation towards a person, situation, or task.\n\nExample:\n1. \"Don't kachiao me lah! I already said I cannot do it.\"\nTranslation: \"Stop bothering me! I already said I can't do it.\"\n\n2. \"The loud construction noise outside is so kachiao!\"\nTranslation: \"The loud construction noise outside is so annoying!\"\n\nAlternate spellings:\nThere are no standardized alternate spellings for kachiao, but it can sometimes be written as \"kahchiao\" or \"ka-chow\" to emphasize the pronunciation.\n\nNote:\nKachiao is considered a casual and informal term used in everyday conversation, particularly among friends or in more relaxed settings. It may not be appropriate to use in formal or professional settings."}
{"word": "Pandan", "description": "Word: Pandan\nPronunciation: /pan-dan/\nAlternate Spellings: Pandang, Pander\n\nDefinition:\nThe term \"Pandan\" refers to both the plant and its distinctive fragrant leaves, which are commonly used in Southeast Asian cuisine, particularly in Singapore. The pandan plant, scientifically known as Pandanus amaryllifolius, is a tropical herb that bears long, narrow green leaves. These leaves have a sweet, floral scent and are often used to add a unique flavor and aroma to various dishes and desserts.\n\nExample:\n- \"I'm going to make some pandan chiffon cake for the party tonight.\"\n- \"Do you have any pandan leaves? I want to add them to my curry.\"\n\nNote: The term \"Pandan\" can also be used as an adjective to describe the flavor, smell, or color associated with pandan leaves or dishes infused with pandan flavor. For instance, \"pandan cake\" refers to a cake flavored with pandan essence, while \"pandan-colored\" refers to a vibrant green hue resembling the color of pandan leaves."}
{"word": "Cik", "description": "Title: Cik\n\nPronunciation: /tsik/\n\nAlternate Spellings: Cic, SIK\n\nDefinition: Cik is a Singlish term derived from the Hokkien dialect, widely used in Singapore. It is an informal slang that is primarily used as an expression to convey disbelief, surprise, or skepticism. Often, it denotes a sense of incredulity or doubt towards a statement or situation.\n\nExample:\n\n1. \"You say you won the lottery? Cik lah, don't bluff!\"\n(Translation: \"You're claiming that you won the lottery? Come on, don't joke around!\")\n\n2. \"Eh, you say you can eat 10 plates of chicken rice? Cik sia!\"\n(Translation: \"Hey, you're saying you can eat 10 plates of chicken rice? No way!\")\n\n3. \"She say she never see 'Crazy Rich Asians,' but she was at the premiere. Cik lah!\"\n(Translation: \"She claims she hasn't seen 'Crazy Rich Asians,' but she was at the premiere. Yeah, right!\")\n\nUsage Notes:\n- Cik is usually used in informal conversations among friends or in casual settings.\n- The tone of the word is often playful, expressing disbelief or teasing.\n- It is essential to pay attention to context and relationship dynamics when using Cik, as it can sometimes come across as confrontational or offensive if used inappropriately.\n\nPlease note that as Singlish is an ever-evolving colloquial language, alternative spellings and pronunciations may exist, but the primary pronunciation provided above is the most commonly used."}
{"word": "Kena", "description": "Kena (pronunciation: \"keh-na\") is a versatile Singlish term that conveys the idea of encountering or experiencing something, often negative in nature. It is derived from the Malay language, where it also carries similar meaning. \n\nAlternate spellings: Kenah, kena or kana (informal variations)\n\nExample phrases:\n1. \"I kena caught in the rain on the way to work.\" (Encountered)\n2. \"He always kena scolded by his boss for being late.\" (Receives)\n3. \"Don't anyhow touch, later kena electric shock!\" (Might experience)\n4. \"I eat too much chili and now kena stomachache!\" (Developed)\n5. \"She kena conned by the online seller.\" (Deceived)\n\nNote: The usage of \"kena\" may vary depending on the context and can refer to various scenarios, such as getting into trouble, receiving punishment, being affected by a situation, or falling victim to a situation."}
{"word": "Kiap", "description": "Title: Kiap\n\nPronunciation: kee-ap\n\nAlternate spellings: Kep\n\nDefinition:\nKiap is a Singlish slang term that is derived from the Hokkien dialect. It is commonly used in Singapore to describe a behavior or action of grabbing or holding on tightly to something, often with a slight connotation of being aggressive or assertive.\n\nExamples:\n1. \"He decided to kiap onto the last available seat on the bus.\"\nTranslation: He decided to grab and hold onto the last available seat on the bus.\n\n2. \"Don't kiap the remote control! Let others watch their favorite shows too.\"\nTranslation: Don't grab and hold onto the remote control. Allow others to watch their favorite shows too.\n\n3. \"She kiap his hand tightly as they walked through the crowded market.\"\nTranslation: She firmly held onto his hand as they walked through the crowded market.\n\nUsage:\nKiap is commonly used in everyday conversations among Singaporeans, particularly when describing situations where someone grabs or holds onto something tightly, whether literally or metaphorically. It can also be used to convey a sense of determination or persistence in ensuring possession or control over something.\n\nNote:\nWhile kiap is predominantly used in Singapore and among the local Chinese community, it may not be easily recognized or understood by non-Singaporeans or those unfamiliar with the Hokkien dialect."}
{"word": "Kiap kiap", "description": "Entry: Kiap kiap\n\nPronunciation: /kēap kēap/\n\nAlternate spellings: Kep kep, Kiep kiep\n\nDefinition:\nKiap kiap is a colloquial Singlish term used to describe the action of quickly grabbing or pinching something, usually with one's fingers. It is often used when referring to small and delicate objects or when expressing a sudden movement or action.\n\nExample 1:\n\"Hey, can you kiap kiap that small screw for me? I can't seem to get a hold of it.\"\n\nExample 2:\n\"I saw a cute puppy on the street and couldn't resist but kiap kiap it gently on its tiny paws.\"\n\nOrigin:\nThe term kiap kiap is derived from the Hokkien influence on Singapore's linguistic landscape. In Hokkien, \"kiap\" (夾) means to clip or pinch. The repetition of the word emphasizes the quick and precise action of grabbing or pinching, giving it a distinct Singlish flavor.\n\nUsage note:\nKiap kiap is commonly used in informal and casual conversations among Singaporeans. This term adds a playful and lighthearted tone to the interaction, making it popular in everyday contexts, especially when talking about small objects or describing swift movements."}
{"word": "Di di", "description": "Word: Di di (dee-dee)\n\nDescription: \n\n- A term commonly used in Singapore to refer to one's younger brother, especially in Chinese families. Derived from the Hokkien (a Chinese dialect) word \"di di\", which means \"little brother\".\n\n- Used affectionately or informally to address a younger male sibling, cousin, or friend.\n\nExample:\n\n- \"Hey, where's your di di? Is he coming to join us for dinner?\"\n\nAlternate spellings: Didie, dee dee, dee-dee"}
{"word": "kiasu", "description": "kiasu (kee-ah-soo) - noun, adjective\n\nDefinition:  \n\nKiasu is a term commonly used in Singapore to describe a person's excessive fear of missing out or the desire to always be ahead, often resulting in overly competitive or selfish behavior. This behavior is characterized by an extreme drive to get ahead of others, whether it be in academics, work, or any other aspect of life. \n\nAlternate spelling:  \n\n- Kee-ah-soo (alternative pronunciation) \n- Kiasuness (noun form) \n\nExample sentences:\n\n- \"She's so kiasu that she studies non-stop to get the highest grade in the class.\"\n- \"Don't be too kiasu, there's enough food for everyone.\"\n- \"His kiasu attitude caused him to push others aside just to get to the front of the line.\"\n\nNote: Kiasu is often used in a playful or self-deprecating manner among Singaporeans, reflecting the society's emphasis on academic achievement and competitiveness."}
{"word": "Garang-guni", "description": "Garang-guni (noun, adjective)\n\nPronunciation: gar-ang-gu-nee\n\nAlternate spellings: Karang-guni\n\nDefinition:\nGarang-guni is a Singlish term that refers to a second-hand goods collector or a rag-and-bone man. The word is derived from the Malay language, where \"garang\" means fierce or ferocious, and \"guni\" refers to a sack or bag used for collection.\n\nDescription:\nA garang-guni is typically an individual who collects discarded items such as household appliances, old clothes, furniture, and other unwanted goods. They often roam the streets, pushing large wooden carts or riding bicycles with attached trailers, navigating through neighborhoods in search of items that people no longer need and are willing to dispose of.\n\nGarang-guni collectors are known to have a keen eye for valuable discarded items that can be resold or repurposed. They play an essential role in recycling and minimizing waste, as they help to give a second life to items that might otherwise end up in landfills.\n\nIn addition to their collection activities, garang-guni collectors sometimes offer their rag-and-bone services, where they purchase recyclable materials from households in exchange for a small sum of money. This transaction provides extra income for some individuals while contributing to the sustainability efforts of recycling.\n\nThe garang-guni trade in Singapore has been part of the cultural landscape for many years, with collectors becoming familiar figures in local neighborhoods. This unique term reflects the resourcefulness and entrepreneurial spirit of these individuals, who continue to play an important role in Singaporean society.\n\nExample:\n1. \"I saw a garang-guni uncle cycling around the neighborhood, collecting old newspapers and cans.\"\n2. \"Instead of throwing your unwanted clothes away, you can donate them to the garang-guni collectors.\"\n\nNote: The term \"garang-guni\" is occasionally used figuratively to describe a person who hoards or collects unnecessary things excessively."}
{"word": "Na", "description": "Title: Na\n\nPronunciation: nah\n\nAlternate Spellings: None\n\nDefinition:\nNa is a versatile Singlish word commonly used to express disbelief, surprise, or to seek confirmation. Its meaning and usage can vary depending on the context and tone.\n\nExamples:\n1. Confirmation: \"You going to the hawker center later, ah? Na?\" (Are you going to the hawker center later, right? Confirm?)\n2. Surprise: \"Na, you bought that expensive bag? Wah, so rich ah!\" (Wow, you bought that expensive bag? Really, so rich!)\n3. Disbelief: \"You finish all the food yourself? Wa, cannot believe, na!\" (You ate all the food by yourself? Wow, can't believe it!)\n\nUsage Notes:\n- 'Na' is often used at the end of a sentence to add emphasis, seeking validation, or expressing doubt.\n- It is commonly used in casual conversations among friends and family.\n- The expression of 'na' can vary in tone, either to show genuine astonishment or to tease/mock someone playfully.\n\nAdditional Information:\n- The usage of 'na' is derived from the Hokkien dialect, where it is used in a similar way to show astonishment or disbelief.\n- Due to its versatile nature, 'na' can also be combined with other Singlish words or phrases to create new expressions, such as \"Na beh, that also can,\" which means \"Unbelievable, that's possible too.\"\n- Caution should be exercised when using 'na' in formal or professional settings, as it is considered informal and may not be appropriate in those contexts."}
{"word": "Dim sum", "description": "Entry: Dim sum (dee-um suh-m)\n\nDefinition:\nDim sum refers to a style of Chinese cuisine that consists of small bite-sized portions of food traditionally served in small steamer baskets or on small plates. It is commonly enjoyed during brunch or tea time, and is typically filled with a variety of ingredients such as meat, seafood, or vegetables.\n\nAlternate Spellings:\n- None\n\nExample Usages:\n1. \"Let's go for dim sum this weekend, I'm craving some steamed dumplings and pork buns!\"\n2. \"I love the variety of dim sum dishes available at this restaurant, especially the char siu bao and har gow.\"\n3. \"It's a tradition for my family to gather for dim sum on Sunday mornings.\"\n\nNote:\nDim sum has become a popular cuisine in Singapore, with numerous dim sum restaurants and hawker stalls offering a wide range of dishes to choose from."}
{"word": "Sayang", "description": "Title: Singlish Dictionary Entry - Sayang\n\nWord: Sayang\n\nPronunciation: /sɑːˈjɑŋ/ (sah-yang)\n\nAlternate Spellings: Sajang, Sajangg, Sajangk\n\nDescription:\nSayang is a versatile Singlish term with multiple meanings and applications. Derived from the Malay language, it can be used as a noun, verb, or an interjection, depending on the context. The word encompasses feelings of endearment, affection, regret, sympathy, or even disappointment.\n\n1. Noun:\nWhen used as a noun, sayang refers to a loved one, a dear person, or a term of endearment used to describe someone close to your heart, such as a partner, family member, or a dear friend. It expresses affection, care, and fondness towards the person addressed.\n\nExample: \"Hey sayang, how was your day?\"\n\n2. Verb:\nAs a verb, sayang can signify feelings of regret or sympathy towards someone or something. It is often used to express concern or emphasize a sense of loss or wasted opportunity. In this context, it can be used in different tenses depending on the situation.\n\nExample 1: \"I sayang-ed my chance to study abroad by not applying on time.\"\nExample 2: \"Don't sayang your money on unnecessary purchases.\"\n\n3. Interjection:\nSayang can also be used as an interjection to express disappointment or sadness, similar to the English equivalent of \"too bad\" or \"what a pity.\" This usage often conveys a sense of empathy or understanding toward unfortunate circumstances.\n\nExample: \"Sayang, we missed the last train! Now we have to take a taxi.\"\n\nNote: It is important to understand the context and tone when using sayang, as it can range from being genuinely caring and affectionate to expressing disappointment or regret.\n\nPlease note that Singlish, being a colloquial language, may have multiple variations in spelling and pronunciation. The alternate spellings included above reflect some of the common variations found within the Singlish linguistic landscape."}
{"word": "Jie jie", "description": "Jie jie (pronounced \"jee jee\") is a term commonly used in Singlish to refer to an older sister or an older female friend. The term is derived from the Chinese word \"jiejie\" (姐姐), which also means older sister. It is often used affectionately to address someone older and more experienced, with a sense of respect and endearment.\n\nAlternate spellings of \"jie jie\" may include \"jiejie\" or \"ji-ji,\" although the pronunciation remains the same. It is important to note that Singlish often incorporates various dialects and languages, resulting in variations in spelling and pronunciation.\n\nExample: \n-\"Hey, Jie jie, can you help me with my homework?\"\n-\"My Jie jie is always there to give me advice.\"\n\nNote: Singlish words and expressions are highly context-dependent and may vary among different speakers."}
{"word": "Off", "description": "Title: 'Off' - Singlish Dictionary Entry\n\nWord: Off\nPronunciation: /ɔf/\nAlternate Spellings: None\n\nDefinition:\n'Off' in Singlish is a versatile colloquial expression that often serves as an adverb, adjective, or verb. While it derives from the English language, its usage in Singlish has adopted unique meanings and contextual nuances.\n\nUsage:\n1. As an adverb:\n   a) To indicate the state of inoperability or deactivation:\n      Example: \"Can turn off the lights, please?\" (Can you please switch off the lights?)\n   b) To express disapproval or disagreement:\n      Example: \"Eh, don't anyhow talk off like that lah!\" (Hey, don't speak offensively like that!)\n\n2. As an adjective:\n   a) To describe the state of not functioning or incorrect behavior:\n      Example: \"Your phone is off, aren't you charging it?\" (Your phone is not working; are you not charging it?)\n\n3. As a verb:\n   a) To switch something off or deactivate:\n      Example: \"Off the TV before you leave the house!\" (Switch off the TV before you leave the house!)\n   b) To decline or reject an invitation or offer:\n      Example: \"She offed my request for a date.\" (She declined my request for a date.)\n\nAdditional Information:\n- The usage of 'off' is often accompanied by other Singlish expressions to intensify or modify its meaning, such as \"off the lights for what\" (why switch off the lights), or \"don't off your phone, it's rude lah\" (don't turn off your phone, it's impolite).\n- 'Off' is commonly employed in everyday conversations and is considered a quintessential part of Singlish.\n\nNote: The spelling and pronunciation of 'off' remain the same as in standard English, with no distinct Singlish variation."}
{"word": "Kor kor", "description": "Dictionary Entry: \"Kor Kor\" (kawr kawr)\n\nPronunciation: koh-koh\n\nAlternate Spellings: Korkor\n\nDefinition:\n\n1. (noun) A term commonly used in Singaporean English or Singlish to refer to an older male sibling or a male cousin who is older than the speaker. It is derived from the Hokkien dialect word \"kor,\" which means older brother.\n\nExample 1:\nBoy 1: Eh, where is your kor kor?\nBoy 2: He went to buy snacks. He'll be back soon.\n\nExample 2:\nGirl 1: Your kor kor is so tall and handsome.\nGirl 2: Yeah, everyone thinks he's cool.\n\nUsage:\n\nThe term \"kor kor\" is primarily used by children or younger individuals to address or refer to their older male siblings or cousins in a familiar and affectionate manner. It is equivalent to \"brother\" in English and is a commonly used term within family settings or informal conversations.\n\nIt is important to note that \"kor kor\" may also be used as a term of respect or endearment by individuals who are not actually related to the person they are addressing. In such cases, it indicates a sense of closeness or familiarity towards an older male friend or acquaintance.\n\nThe alternate spelling \"Korkor\" is less common but serves the same purpose as \"kor kor.\" Both spellings have the same pronunciation and can be used interchangeably."}
{"word": "On", "description": "Title: Singlish Dictionary - 'On'\n\nDefinition:\nThe word 'On', commonly used in Singlish, is a versatile adverb that denotes the state of activation or operation of something or someone. It is primarily placed before a verb to indicate an action or process happening at the current moment or to express the functionality of an object.\n\nPronunciation:\n/on/\n\nAlternate Spellings:\nNone\n\nExample usages:\n1. \"Eh, turn on the fan lah. It's so hot in here!\"\nTranslation: \"Hey, please activate the fan. The room is really hot.\"\n\n2. \"Why you never on the lights before entering the room?\"\nTranslation: \"Why didn't you switch on the lights before entering the room?\"\n\n3. \"I cannot on my computer. It got problem.\"\nTranslation: \"I cannot start up my computer. There's some issue.\"\n\n4. \"Mai siao, on the air-conditioning first!\"\nTranslation: \"Don't be silly, turn on the air-conditioning first!\"\n\n5. \"Don't forget to on the alarm before you leave the house.\"\nTranslation: \"Remember to activate the alarm before you leave the house.\"\n\nNotes:\nThe word 'On' is also often used colloquially to refer to the starting of electronic devices, appliances, or even to activate systems or functions. In this context, it is commonly used with verbs such as turn on, switch on, power on, on-off, among others, to convey the intended meaning. The word can also be used in combination with other verbs to express various actions related to activation or operation."}
{"word": "Goreng pisang", "description": "Dictionary Entry:\n\nWord: Goreng pisang (go-ren pee-sang)\n\nPronunciation: ɡɔːrɛŋ pɪˈsɑŋ\n\nAlternate Spellings: None\n\nDefinition:\n\n1. Noun - A popular Malay snack consisting of bananas that are coated in a batter made of flour, sugar, and spices, and then deep-fried until they turn golden brown. The bananas used are typically pisang raja (a type of banana), but other varieties may also be used.\n\n2. Exclamation - Used colloquially to express amazement, excitement, or surprise. Similar to saying \"wow\" or \"amazing!\"\n\nExample Sentences:\n\n1. I'm craving some goreng pisang for tea; the crispy outer layer and sweet, soft banana inside is irresistible.\n\n2. Goreng pisang is a hit at parties; it's always the first snack to disappear from the table.\n\n3. Goreng pisang! Look at that beautiful sunset, so breathtakingly colorful!\n\nOrigin:\n\nThe term \"goreng pisang\" originates from Malay, with \"goreng\" meaning \"fried\" and \"pisang\" meaning \"banana.\" This term is commonly used in Singapore and Malaysia, where goreng pisang is a beloved local delicacy and a popular street food. It has also gained recognition and popularity beyond these regions due to its delicious taste and unique texture."}
{"word": "Tabao", "description": "Tabao\n\nPronunciation: tah-bao\n\nAlternate spellings: da bao\n\nDefinition: \n\n1. (verb) To tabao refers to the act of ordering food from a restaurant or hawker stall for takeout or takeaway. It is commonly used in Singapore and is derived from the Hokkien dialect, which means to \"pack\" or \"take away\". \n\n2. (noun) Tabao can also be used as a noun to refer to the food that is taken away or a takeout order.\n\nExample:\n\n1. Verb usage:\n   - \"Let's tabao dinner tonight. I don't feel like cooking.\"\n   - \"Can you tabao some chicken rice for me? I'm in a rush.\"\n\n2. Noun usage:\n   - \"I bought some tabao for everyone. Enjoy!\"\n   - \"I have a tabao order for pickup. Can you let me know when it's ready?\"\n\nNote: The term \"tabao\" is commonly used in Singapore, especially in local food culture, and is understood by most locals. It is also seen as a more colloquial term compared to \"takeaway\" or \"takeout\"."}
{"word": "Orh-hor", "description": "Dictionary Entry: Orh-hor\n\nPronunciation: Aw-haw\n\nAlternate Spellings: Orh Haw, Or Hor, Aw Haw\n\nDefinition:\nOrh-hor is a Singlish phrase commonly used in Singapore, particularly in Hokkien or Chinese dialects. It is an interjection that signifies a sense of disbelief or doubt, often used when expressing skepticism or surprise. This phrase is typically used in casual conversations among friends, family members, or colleagues.\n\nExample Usage:\n1. \"Orh-hor, you mean he won the lottery twice in a row? That's unbelievable!\"\n2. \"I just bumped into Jimmy at the mall! Orh-hor, what a small world!\"\n\nEtymology:\nThe term 'orh-hor' is derived from the combination of \"orh\" and \"hor,\" both of which have their individual meanings within the phrase. \"Orh\" is a Hokkien word that translates to \"oh\" in English, expressing surprise or realization. \"Hor\" is derived from Hokkien as well, translating to \"good\" or \"okay.\" When combined, \"orh-hor\" conveys a sense of disbelief or incredulity towards a particular statement or situation.\n\nUsage Note:\nThe term 'orh-hor' is commonly used in informal conversations in Singapore and may not be recognized or understood by individuals unfamiliar with Singlish or the local dialects. It is important to use this phrase appropriately and be mindful of the audience's familiarity with Singlish expressions."}
{"word": "Gula melaka", "description": "Gula melaka (pronounced goo-lah meh-lah-kah) is a term commonly used in Singaporean English, also known as Singlish, to refer to a dark, viscous sugar made from the sap of the coconut palm. \n\nAlternate Spellings:\n- Gula malacca\n\nOriginating from Malay, 'gula' means sugar, while 'melaka' refers to the historic city of Melaka in Malaysia, which was known for its production of high-quality palm sugar. Often used in local cuisine and desserts, gula melaka is treasured for its rich caramel-like flavor and distinct aroma.\n\nExample:\n\"Can you please add some gula melaka to the kaya toast? It'll give it a sweeter taste.\"\n\nPlease note that Singlish words may not follow strict phonetic rules and can vary in pronunciation depending on the speaker's accent and intonation."}
{"word": "Tolong", "description": "Entry: Tolong (toh-long)\n\nPronunciation: /toh-long/\n\nAlternate spellings: -\n\nDefinition: \n\nTolong is a Singlish term derived from the Malay language, meaning \"please\" or \"help.\" It is commonly used to express a polite request or to seek assistance from someone. This word is closely related to the concept of mutual respect and cultural norms in Singapore.\n\nExample:\n\n1. \"Tolong, can you please pass me the salt?\"\n   (Excuse me, could you kindly hand me the salt, please?)\n\n2. \"Tolonglah, help me carry this heavy bag.\"\n   (Please, lend me a hand in carrying this heavy bag.)\n\n3. \"Eh, tolong, where can I find a good restaurant around here?\"\n   (Excuse me, could you help me find a good restaurant in this area?)\n\nUsage note:\n\n1. When using \"tolong\" in a sentence, it is common to include \"lah\" as a sentence-ending particle to add emphasis or to convey a sense of friendliness. For example, \"tolonglah\" or \"tolong, lah.\"\n\n2. \"Tolong\" can also be used as an expression of urgency or pleading. In such cases, it is common to repeat the word multiple times for emphasis. For example, \"Tolong, tolong, tolong, I'm in trouble!\"\n\n3. This term is widely understood and used in Singapore, especially in casual conversations. However, in more formal settings, it is advisable to use \"please\" instead.\n\nNote: Singlish is a colloquial form of English spoken in Singapore, incorporating elements of Malay, Chinese dialects, Tamil, and other languages commonly spoken in the country."}
{"word": "Mei mei", "description": "Word: Mei mei\nPronunciation: may may\n\nDefinition:\nMei mei is a term used in Singlish to refer to a younger sister or a younger female friend. It is often used affectionately and in a playful manner. The term is borrowed from the Chinese language, where \"mei mei\" (妹妹) also means younger sister.\n\nAlternate spellings:\n- Meimei\n\nExample:\n\"Hey, where is your mei mei? I haven't seen her in a while.\"\n\nNote: Mei mei is an endearing term and is mostly used within close relationships or among friends. It is important to consider the context and the relationship before using this term to avoid potential misunderstandings."}
{"word": "paiseh", "description": "Word: Paiseh\n\nPronunciation: [pie-say]\n\nAlternate spellings: None\n\nDefinition:\nPaiseh is a popular Singlish term derived from the Hokkien dialect, widely used in Singapore. It conveys a feeling of embarrassment, shyness, or awkwardness, often associated with a sense of guilt or shame. It is commonly used when someone feels sorry or regretful for a certain action or if they believe they have inconvenienced or let others down.\n\nExample:\n1. \"Aiyo, I forgot to bring my wallet out. Paiseh, can you lend me some money first?\"\nTranslation: \"Oh no, I've forgotten my wallet. I feel embarrassed, can you lend me some money for now?\"\n\n2. \"Paiseh ah, I accidentally spilled your drink. Let me clean it up for you.\"\nTranslation: \"I'm sorry, I feel embarrassed. I accidentally spilled your drink. Let me clean it up for you.\"\n\n3. \"Eh, paiseh to disturb you, but can you help me with this math question?\"\nTranslation: \"Hey, sorry to bother you, but can you help me with this math question? I feel embarrassed to ask.\"\n\nNote: Paiseh is a versatile word that reflects the Singaporean culture of politeness and consideration for others. It is used to express an apology, seek forgiveness, or show courtesy even in casual situations. The word is widely embraced and understood by locals and is an integral part of Singlish conversations."}
{"word": "Hor fun", "description": "Title: Hor Fun\n\nPronunciation:\n[hawr fuhn]\n\nAlternate spellings:\n- Hor fun\n- Hor funn\n\nDefinition:\nHor fun refers to a popular dish found in Singaporean cuisine that consists of flat rice noodles stir-fried with various ingredients such as meat, seafood, vegetables, and soy sauce. The dish is commonly served in a flavorful sauce and is known for its smooth and silky texture.\n\nExample:\n\"I'm craving some hor fun for lunch today. It's the perfect comfort food!\"\n\nOrigin:\nThe term \"hor fun\" is derived from the Cantonese language, with \"hor\" meaning 'braised' or 'smooth' and \"fun\" referring to 'rice noodles.' The dish has its roots in Cantonese cuisine but has become widely popular in Singapore, where it is commonly found in hawker centers, food courts, and Chinese restaurants.\n\nUsage:\n1. \"Let's go to the hawker center and get some hor fun for dinner!\"\n2. \"I love the combination of sliced beef and thick, chewy hor fun in this dish.\"\n3. \"This restaurant is famous for its seafood hor fun. We have to try it!\"\n\nNote:\nIn Singapore, hor fun may also be referred to as 'kway teow' by the Hokkien-speaking community, but the term 'hor fun' is more commonly used and understood across different dialect groups in the country."}
{"word": "Nenek", "description": "Nenek (neh-nehk)\n\nDescription:\nNenek, derived from the Malay language, is a Singlish term referring to the maternal grandmother or an elderly woman. It is a term of endearment used to address or describe one's grandmother or any elderly lady with affection and respect. The word carries a warm and familial connotation, reflecting the intimate relationship and reverence towards one's grandmother or an older lady.\n\nAlternate spellings:\n- Nek\n- Neneh\n\nExample sentences:\n1. \"Nenek, can you teach me how to make your famous chicken curry?\"\n2. \"I love spending time with my nenek, she always tells the best stories.\"\n3. \"Look at that kind nenek helping the children cross the road.\"\n\nNote: Singlish is a colloquial language commonly spoken in Singapore. It blends English with words and phrases from various local languages such as Malay, Chinese dialects, and Tamil."}
{"word": "See lah", "description": "Word: See lah\n\nPronunciation: [si lah]\n\nAlternate Spellings: See la, Si lah, Si la\n\nDefinition:\n'See lah' is a popular Singlish expression that conveys a mixture of resignation, annoyance, or skepticism towards a situation or someone's actions. It is used to emphasize one's point or to indicate a sense of agreement with a statement. 'See lah' can be used playfully or sarcastically, depending on the context and tone of voice.\n\nExample:\nPerson A: \"I forgot my umbrella, and it's raining so heavily!\"\nPerson B: \"See lah, I told you to check the weather forecast before leaving.\"\n\nIn this example, Person B uses 'See lah' to express their frustration towards Person A's forgetfulness and imply that Person A should have been more prepared.\n\nNote:\n'See lah' is derived from the combination of the English word \"see\" and the Hokkien and Malay word \"lah.\" The usage of 'lah' is a common feature in Singlish, giving phrases a distinctly Singaporean flavor. It adds emphasis, emphasis, tone, or context to a sentence, making it an essential part of everyday speech among Singaporeans."}
{"word": "See", "description": "Word: See\n\nPronunciation: /siː/\n\nDescription:\n- Part of Speech: Verb\n- Definition: To understand or comprehend something. It is commonly used to convey the meaning of \"I understand\" or \"I see what you mean.\"\n- Example: \"I see what you mean, lah. It makes sense now.\"\n\nAlternate Spellings:\n- Sia: This spelling is often used in informal conversations or text messages, especially among younger generations.\n- Si: A shortened version of \"see\" that is commonly used in casual conversations.\n\nNote: In Singlish, \"see\" can also be used as an interrogative particle at the end of a sentence to seek confirmation or agreement. For example, \"Let's go eat at the hawker centre, see?\" This usage adds emphasis and a sense of inclusiveness in the conversation."}
{"word": "Pui", "description": "Pui [poo-ee] (Alternate Spelling: Puih)\n\nDefinition:\nPui is a Singaporean slang term derived from Hokkien dialect, commonly used to express disgust, distaste, or disapproval. It is often utilized to convey a negative reaction towards something unpleasant, unattractive, or unfavorable. It can also be used to ward off bad luck or negative energy.\n\nExample:\n1. \"Pui! This food tastes terrible lah!\"\n2. \"Eh, don't go to that place, pui, very dirty one.\n\nUsage:\nPui is typically spoken with a strong emphasis on the 'p' sound, followed by the 'oo' sound, and ending with a slightly prolonged 'ee' sound. The tone and volume of its delivery may vary depending on the intensity of the disgust or disapproval being expressed.\n\nNote: This term is commonly used in Singaporean English, known as Singlish."}
{"word": "Ice kacang", "description": "Title: Ice Kacang\n\nWord: Ice kacang\nPronunciation: /aɪs kʌtʃæŋ/\nAlternate Spellings: Ais kacang, Ais kachang\n\nDefinition:\nIce kacang, a popular dessert in Singapore and Malaysia, is a refreshing and colorful concoction made by combining a variety of ingredients served over shaved ice. It is commonly referred to as \"ABC\" (Ais Batu Campur) in Malaysia. \n\nDescription:\nIce kacang is a delightful cold dessert that provides a perfect respite from the tropical heat. It is made by finely shaving or crushing ice into a snow-like texture, which forms the base. Over this ice, a combination of delicious ingredients is generously added, creating a burst of flavors and textures.\n\nThe ingredients used to create ice kacang can vary but commonly include red beans, sweet corn, grass jelly, agar-agar (a jelly-like substance), small cubes of flavored jelly, and sometimes attap chee (palm seeds) or durian (a tropical fruit). These ingredients are typically heaped onto the shaved ice bed, allowing each spoonful to bring about a delightful mixture of tastes.\n\nIce kacang is then finished off with a drizzling of generous sweet syrups, such as rose or pandan syrup, and sometimes condensed milk, which adds a creamy richness to the dessert. Some variations may include a scoop of ice cream on top for an added indulgence.\n\nThe resulting dish is a colorful medley of ingredients, flavors, and textures that creates a satisfying and refreshing dessert experience. Ice kacang is widely enjoyed by locals and visitors alike, making it a staple treat at hawker centers, food courts, and dessert stalls across Singapore and Malaysia.\n\nExample:\n\"I'm craving something sweet and refreshing. Let's head to the nearby hawker center for a bowl of ice kacang.\"\n\n\"Ice kacang is the perfect way to cool down on a hot day with its mix of shaved ice, colorful toppings, and sweet syrup.\"\n\nNote:\nSinglish is a colloquial language influenced by English, Malay, Hokkien, Cantonese, and Tamil. Transliterations and alternate spellings may vary based on individual preferences or regional variations."}
{"word": "Ikan bilis", "description": "Title: Ikan bilis\n\nDescription:\nIkan bilis is a common term used in Singlish which refers to small dried anchovies. These tiny, silver-colored fish are a popular ingredient in many traditional Malay and Singaporean dishes. Ikan bilis is widely used for its unique flavor and as a crunchy ingredient in various cuisines.\n\nPronunciation: ee-kan bee-liss\n\nAlternate spellings: Ee kan bilis, Ikan belis, Ikan bilyss\n\nExample sentences:\n1. \"I love the crispy texture that ikan bilis adds to my nasi lemak.\"\n2. \"Could you get me a packet of ikan bilis from the market?\"\n3. \"My grandmother's secret ingredient in her sambal is homemade ikan bilis.\"\n\nNote: Singlish, or Singaporean English, is an informal blend of English, Malay, Hokkien, Tamil, and other local dialects. As such, spellings and pronunciations may vary among speakers. The provided variant spellings capture some of these variations commonly observed in spoken Singlish."}
{"word": "Siao", "description": "Title: Siao (Slang)\n\nPronunciation: sa(y)·ow\n\nAlternate Spellings: Siao, Siow\n\nDescription:\nSiao is a colloquial Singaporean term derived from the Hokkien dialect meaning \"crazy\" or \"mad.\" It is commonly used in Singlish, the local English-based creole language spoken in Singapore. This term is predominantly used to describe someone or something that is acting in a wild, irrational, or eccentric manner. Siao often conveys a sense of exasperation or disbelief, similar to the English equivalents of \"insane,\" \"nuts,\" or \"out of one's mind.\" It is frequently used in a joking or lighthearted manner among friends and acquaintances to tease or mock someone's eccentric behavior.\n\nExample usages:\n1. \"Don't scare me like that lah, you make me think siao already!\"\n2. \"Eh, you see that guy dancing in the middle of the street? He damn siao lah!\"\n3. \"My friend bought a pet lizard and let it roam free in the house. Confirm siao one!\"\n\nNote:\nIn casual conversations, siao is often used as a standalone phrase to express surprise or disbelief, similar to the English phrase \"you must be joking\" or \"no way!\" This form of usage does not relate specifically to describing someone's mental state but rather emphasizes the incredulity of a statement or situation."}
{"word": "shiok", "description": "shiok (adj.)\nPronunciation: /ʃʊk/\n\nDefinition:\nA popular Singlish term used to describe an intense feeling of pleasure, satisfaction, or enjoyment. This word is often used to express delight or excitement about something.\n\nExample:\n- \"The food at that hawker center was so shiok! I couldn't get enough of it.\"\n- \"I just got a promotion at work - damn shiok lah!\"\n\nAlternate spellings:\n- syok\n- shiok lah"}
{"word": "Jajan", "description": "Entry: Jajan\n\nPronunciation: jah-jahn\n\nAlternate Spellings: Jajan is typically spelled as 'ジャジャン' in Japanese script or as '加加' in simplified Chinese characters.\n\nDefinition:\n- Noun: Jajan refers to a popular term used in the local Singlish dialect, specifically in Singapore. It is derived from the Japanese word 'jajanai', which means \"not good/not worth it.\" In Singlish, 'Jajan' is used to describe something that is disappointing or unsatisfactory in nature.\n\nExample:\n- \"I bought this new phone, but the battery life is so short, it's very jajan!\"\n- \"Don't bother going to that restaurant, the food there is jajan lah!\"\n\nUsage notes:\n- The word 'Jajan' is commonly used in informal conversations, particularly among younger Singaporeans.\n- It is frequently used to express disappointment or to criticize something that falls short of expectations.\n- 'Jajan' can also be used in a lighthearted or sarcastic manner to make fun of a situation or object.\n\nSynonyms: Not worth it, disappointing, unsatisfactory, lousy\n\nNote: The term 'Jajan' has its roots in the Japanese language but has taken on a slightly different meaning in Singlish. It is important to recognize that its usage may vary among different individuals and contexts."}
{"word": "kaya", "description": "Kaya (pronounced kah-yah) is a noun in Singlish that refers to a popular sweet and aromatic spread typically made from coconut milk, eggs, sugar, and pandan leaves. The word 'kaya' is derived from the Malay language, where it translates to 'rich' or 'wealthy', reflecting the rich and creamy texture of the spread. \n\nAlternate spellings for 'kaya' include 'kaya' or 'coconut jam'. However, 'kaya' is the most commonly used term in Singlish.\n\nExample sentences:\n1. \"I enjoy having kaya toast for breakfast.\"\n2. \"Do you want kaya on your toast, or would you prefer peanut butter?\""}
{"word": "Uncle", "description": "Sure! Here's a dictionary entry for the term \"Uncle\" in Singlish:\n\nWord: Uncle\n\nPart of Speech: Noun\n\nPronunciation: [ˈʌŋ.kəl] (uhn-kuhl)\n\nAlternate spellings: Ah Uncle (in informal usage)\n\nDefinition:\n1. An honorific term commonly used in Singapore to address or refer to an older man who is of similar age or older than one's parent or guardian. It is typically used to show respect and is often used by younger individuals or strangers when addressing an older man.\n\nExample:\n- \"Excuse me, Uncle, do you know where the nearest bus stop is?\"\n- \"Uncle Lim is a friendly neighbor who always greets us with a smile.\"\n\n2. In a broader sense, \"Uncle\" is sometimes used to refer to any random older man, regardless of their relationship to the speaker. This usage is more informal and can be employed when seeking assistance or engaging in casual conversation with unknown individuals.\n\nExample:\n- \"Uncle, is this seat taken?\"\n- \"Hey, Uncle! Can I borrow your phone charger for a few minutes?\"\n\nNote:\nThe term \"Uncle\" is not limited to immediate family relations but is also commonly used to address family friends, acquaintances, or even older individuals with a paternal-like presence. It reflects the Singaporean culture's emphasis on respecting and acknowledging seniority. The formal usage of \"Ah Uncle\" is more colloquial and frequently used in casual conversations, adding an affectionate tone.\n\nPlease note that Singlish is a colloquial language mix, and the use of terms may vary based on context and individuals involved."}
{"word": "Sekali", "description": "Word: Sekali\n\nPronunciation: /səˈkɑːli/\n\nAlternate Spellings: Sikali, Sekarli, Sekarlian\n\nDescription:\n\"Sekali\" is a versatile Singlish expression that can be used in various contexts to convey different meanings. It is derived from the Malay word \"sekali\" which means \"once\" or \"one time\". However, in Singlish, the usage of \"sekali\" goes beyond its literal translation and is often used to add emphasis, express surprise, or convey a hypothetical situation.\n\n1. Expression of Surprise:\n\"Sekali\" is frequently used at the beginning of a sentence to indicate a surprising or unexpected outcome. It can be translated as \"what if\" or \"who would have thought.\" For example:\n- \"Sekali, I won the lottery!\"\n- \"I thought she would fail her exams, sekali she scored the highest in the class.\"\n\n2. Expression of Hypothetical Situations:\n\"Sekali\" can be used to introduce hypothetical or unlikely scenarios. It implies a sense of caution or anticipation of unexpected outcomes. For example:\n- \"You should bring an umbrella in case it rains, sekali you get caught in a downpour.\"\n- \"I better study hard, sekali the questions are difficult.\"\n\n3. Emphasizing a Condition:\n\"Sekali\" can be used to emphasize the condition or contingency of a statement. It suggests the possibility of an unexpected consequence. For example:\n- \"I'm going to the shops, sekali there's a huge sale going on.\"\n- \"I'm on a diet, sekali someone brings cake to the office.\"\n\nNote: \"Sekali\" should be used casually in conversations or informal writing. In more formal contexts, it is best to use standard English expressions or phrases.\n\nRelated Terms:\n- \"Eh, Sekali\": An interjection used to express surprise or disbelief (e.g., \"Eh, sekali he won the competition leh!\")\n\nExamples:\n1. \"I don't think the bus will be crowded at this time, sekali we can get seats.\"\n2. \"Sekali, she turns out to be your long-lost sister!\"\n3. \"Don't forget your umbrella, sekali it pours heavily later.\"\n4. \"I'm going to scramble some eggs, sekali I burn the whole kitchen down!\"\n5. \"Don't worry, the movie won't be scary, sekali it gives me nightmares!\"\n\nPlease note that while Singlish is widely spoken and understood in Singapore, it is considered informal and should be used appropriately in the appropriate setting."}
{"word": "Keropok", "description": "Keropok (kuh-roh-pok) - also spelled as keropok or krupuk\n\nDefinition:\nKeropok refers to a traditional Malay snack commonly found in Singapore, Malaysia, and Indonesia. It is a type of crispy, deep-fried cracker made from a mixture of starch and various ingredients such as prawns, fish, or vegetables. Keropok is typically enjoyed as a crunchy accompaniment to meals or eaten as a standalone snack.\n\nExample:\n\"Hey, let's grab some keropok at the hawker center!\"\n\"I love the prawn keropok, it's so flavorful and crispy.\"\n\nNote: Keropok is sometimes referred to as krupuk in Indonesian language."}
{"word": "Suka suka", "description": "Word: Suka suka\n\nPronunciation: soo-kah soo-kah\n\nAlternate Spellings: Sukar sukar, soka soka, suker suker\n\nDefinition:\nSuka suka is a commonly used Singlish phrase that describes a nonchalant or arbitrary action. It refers to doing something according to one's whims and fancies without any specific reason or rationale. The phrase is often used to highlight a sense of spontaneity or carefreeness in decision-making or behavior.\n\nExample:\n\n1. \"Why did you choose the pink shirt today?\"\n   \"No reason lah, just suka suka wear only.\"\n\n2. \"Don't simply change the TV channel suka suka, I was watching something!\"\n\n3. \"He suka suka go and buy random items at the supermarket without making a grocery list.\"\n\n4. \"My boss always changes his mind suka suka, it's hard to plan anything!\"\n\nUsage Notes:\n- Suka suka is often used in a light-hearted or playful manner.\n- It can also imply a lack of consideration for others' opinions or preferences.\n- The phrase is also commonly used in Singlish colloquial conversation.\n- Suka suka can be used both as an adjective to describe a person's behavior or as a verb to describe an action.\n\nRelated Terms:\n- Chope: To reserve or secure a spot or item, often in a casual or unorthodox manner. (e.g., \"Chope a seat.\")\n- Sabo: To sabotage or cause trouble for someone intentionally. (e.g., \"Why you always sabo me?\")"}
{"word": "Kecap manis", "description": "Entry: Kecap Manis\n\nPronunciation: keh-chap mah-nis\n\nAlternate spellings: Kicap manis, Ketjap manis\n\nDefinition:\nKecap Manis refers to a popular Indonesian condiment that is sweet in taste. It is a thick, dark brown sauce made from soybeans, sugar, water, and various spices. In Singlish, Kecap Manis is commonly used as a versatile marinade and dipping sauce for various dishes, adding a unique sweet and savory flavor. It is pronounced similarly to the Malay pronunciation, reflecting the influence of Indonesian culture in Singapore.\n\nExample:\n\"I love drizzling some Kecap Manis on my grilled chicken for an extra burst of flavor!\"\n\nNote: Kecap Manis is widely available in supermarkets and Asian grocery stores across Singapore, making it a staple ingredient in many households and a favorite among food enthusiasts."}
{"word": "Kopi", "description": "Word: Kopi\nPronunciation: koh-pee\nAlternate Spellings: Kopee, Kopey\n\nDefinition:\nKopi is a term commonly used in Singapore to refer to coffee. The word is derived from the Malay language. However, in Singlish, it has taken on a unique meaning and is often used to describe a specific style of coffee commonly found in local coffee shops, also known as \"kopitiams\".\n\nIn Singapore, Kopi is known for its strong and flavorful taste. It is typically brewed by mixing roasted coffee beans with sugar and condensed milk, resulting in a sweet and creamy beverage. The coffee is traditionally served in a small cup with a handle, known as a \"kopi cup\", which is often accompanied by a saucer. Kopi is usually enjoyed alongside popular local food such as kaya toast, soft-boiled eggs, and various types of local snacks.\n\nUsage:\n1. \"Let's head to the kopitiam to grab a cup of kopi before work.\"\n2. \"I prefer Kopi O, without milk.\"\n3. \"Uncle, can I have a kopi gao? I need a strong cup of coffee today.\"\n\nNote: In Singlish, various suffixes are often added to \"kopi\" to indicate different variations. For instance, \"kopi kosong\" refers to black coffee without sugar or milk, while \"kopi peng\" refers to iced coffee."}
{"word": "terbalik", "description": "Title: TERBALIK\n\nTerbalik \\tər-ba-lik\\ (Also spelled as \"terbalak\", \"terberlik\")\n\nPart of Speech: Adjective\n\nPronunciation: ter-ba-lik (tər-ba-lik)\n\nDefinition:\nTerbalik is a term commonly used in Singapore to describe something that is flipped, inverted, or turned upside down. It is derived from the Malay word \"terbalik\", which carries the same meaning. This Singlish word is often used in informal conversations or everyday situations to express a state of reversal or a complete change in position, order, or circumstances.\n\nExample Sentences:\n1. My car got terbalik in the heavy rain last night.\n2. She hung the picture frame terbalak, and now it looks strange on the wall.\n3. Don't hold the bowl too loosely, or the contents might terberlik onto the floor.\n\nNotes:\n- Terbalik can be used both figuratively and literally, depending on the context.\n- When pronounced, the stress falls on the first syllable \"ter-\".\n- Alternate spellings for terbalik include \"terbalak\" and \"terberlik\", but \"terbalik\" is the most commonly used spelling.\n\nUsage Tip:\nTerbalik is often used in colloquial conversations among locals in Singapore. It adds a touch of informality and familiarity to the language, making it easier to relate to others in casual settings."}
{"word": "Kueh", "description": "Title: Kueh\n\nWord: Kueh\nPronunciation: /kweɪ/\n\nDefinition:\nKueh is an umbrella term used in Singapore to refer to a wide variety of traditional Asian desserts. These delectable treats play an essential role in Singaporean and Malaysian cuisine. Kueh is an integral part of cultural celebrations, festive occasions, and everyday snacks.\n\nAlternate Spellings:\n- Kuih (Malaysian English)\n\nExamples:\n\n1. Ang Ku Kueh:\n   - Pronunciation: /æŋ kuː kweɪ/\n   - Description: A small, reddish, turtle-shaped snack made from glutinous rice flour and filled with sweet mung bean paste. Often eaten during festive occasions and as an offering to deities.\n\n2. Kueh Lapis:\n   - Pronunciation: /kweɪ ˈlɑpɪs/\n   - Description: Also known as Layered Cake, it is a colorful and visually appealing dessert made by layering different-colored sweetened rice flour and coconut milk batter, steaming each layer before adding the next.\n\n3. Ondeh Ondeh:\n   - Pronunciation: /ɔːnˈdeɪ ɔːnˈdeɪ/\n   - Description: Round, bite-sized balls filled with palm sugar and coated with grated coconut. These soft and chewy dumplings are typically green in color due to the addition of pandan leaf juice.\n\n4. Kueh Tutu:\n   - Pronunciation: /kweɪ ˈtuːtuː/\n   - Description: Dumplings made from steamed rice flour filled with a variety of ingredients, such as crushed peanuts, grated coconut, or chocolate. They are wrapped in a pandan leaf cone for added fragrance and served warm.\n\n5. Kueh Pie Tee:\n   - Pronunciation: /kweɪ paɪ tiː/\n   - Description: Crispy, cone-shaped pastry shells filled with a mixture of vegetables, prawns, and sweet sauce. It is a popular Peranakan snack often enjoyed during festive celebrations.\n\nIn conclusion, kueh encompasses a vast array of mouthwatering sweets and snacks that showcase the cultural richness and diversity of Singapore and Malaysia. From colorful layered cakes to bite-sized dumplings, kueh is a beloved part of Asian culinary heritage."}
{"word": "Kueh tu tu", "description": "Title: Kueh Tu Tu\n\nPronunciation: /kweɪ tuː tuː/\n\nAlternate Spellings: Kueh Tutu, Kueh Tutu\n\nDefinition:\nKueh Tu Tu is a popular traditional Singaporean snack and a beloved treat loved by locals and tourists alike. This dessert is made from steamed rice flour enveloped in a fragrant filling, typically made from a mixture of grated coconut and palm sugar.\n\nUsage:\n- \"Let's go to the hawker center and have some Kueh Tu Tu for tea!\"\n- \"My favorite part of the cultural festival is indulging in Kueh Tutu creations from different vendors.\"\n\nAdditional Information:\nKueh Tu Tu derives its name from the Malay language, where \"kueh\" refers to a sweet or savory snack, while \"tu tu\" is an onomatopoeic term used to describe the sound made when the snack is steamed. The snack is typically prepared by filling small cupcake-like moulds with a portion of sweet filling, followed by a layer of rice flour batter. The moulds are then steamed until the batter becomes firm and the filling is fragrant and gooey, resulting in a delightful blend of textures.\n\nKueh Tu Tu is commonly found in Singapore's traditional markets, hawker centers, and street food stalls. It is often served on bamboo leaves with a sprinkle of grated coconut on top, adding a further burst of flavor. This mouthwatering treat offers a combination of sweet and savory flavors that make it a popular choice among locals and tourists seeking an authentic taste of Singaporean cuisine."}
{"word": "ketupat", "description": "ketupat (kay-tuh-pat)\nAlternate spellings: k'put, ketupat (Malay spelling)\n\nDefinition:\nKetupat is a traditional Malay dish made from glutinous rice that has been wrapped in a square pouch woven from coconut leaves. The rice is steamed until it becomes compressed and takes on a triangular shape. Ketupat is commonly consumed during festive occasions such as Hari Raya Aidilfitri and served alongside dishes like rendang and satay. It is frequently enjoyed with peanut sauce (kuah kacang) and adds a flavorful complement to the meal.\n\nExample:\n\"During Hari Raya, my grandmother would always prepare delicious ketupat to serve with the mouthwatering rendang.\"\n\nOrigin:\nThe word \"ketupat\" originates from the Malay language, where \"keto\" means to tie or pack, while \"pat\" refers to a container. The name reflects both its process of preparation and the shape in which it is presented."}
{"word": "Kway teow", "description": "Entry: Kway Teow\n\nPronunciation: /kway tao/ (rhymes with \"way cow\")\n\nAlternate Spellings: Kuay Teow, Kuey Teow\n\nDefinition:\nKway Teow refers to a popular dish in Singaporean cuisine that consists of stir-fried or broth-cooked flat rice noodles. These wide and silky rice noodles are commonly used as a base for various dishes, such as Char Kway Teow and Fried Kway Teow, which are cherished by locals and visitors alike. \n\nThe term \"kway teow\" is derived from the Hokkien dialect, spoken by the Chinese community in Singapore. In Mandarin Chinese, these noodles are known as \"河粉\" (hé fěn), which translates to \"river noodles,\" reflecting their smooth texture.\n\nUsage:\n1. \"Let's go to the hawker center and get some Kway Teow for lunch.\"\n2. \"I'm craving Fried Kway Teow – the one from the stall near my house is the best!\"\n3. \"My grandmother makes delicious homemade Kway Teow soup with fish balls.\"\n\nNote:\nKway Teow is a versatile dish that can be found in various forms across Southeast Asia. While this dictionary entry focuses on its Singaporean context, variations of Kway Teow dishes, with regional adaptations, can also be found in Malaysia, Thailand, and other neighboring countries."}
{"word": "laksa", "description": "laksa [lahk-suh] (alternative spelling: laksah) \n\nDefinition:\nLaksa refers to a savory and spicy noodle soup dish that is popular in Singapore and Malaysia. It is a fusion of Chinese and Malay culinary influences. The dish typically consists of thick rice noodles (or sometimes vermicelli noodles) served in a rich, fragrant, and coconut milk-based broth, flavored with a variety of spices such as turmeric, lemongrass, and galangal. The soup is usually garnished with ingredients like prawns, fish cake, tofu puffs, bean sprouts, and fresh herbs.\n\nExample:\n\"Let's go to the hawker center and have some laksa for dinner. It's my favorite!\"\n\nPronunciation: \nlahk-suh\n\nNote: Singlish is a colloquial form of English spoken in Singapore, incorporating words and phrases from various languages such as Malay, Chinese, and Tamil. Laksa is a widely-known word in Singlish and its pronunciation is similar to its English counterpart."}
{"word": "lontong", "description": "Word: Lontong (lon-tong)\nAlternate Spellings: N/A\n\nDefinition:\nLontong is a Malay term commonly used in Singlish to refer to a popular traditional Indonesian dish made from compressed rice cake, typically served with various vegetables, peanut sauce, and other accompaniments. It is a staple dish in Southeast Asia, often enjoyed as breakfast or brunch.\n\nExample:\n- \"Let's go for breakfast and have some delicious lontong at the nearby hawker center.\"\n- \"I love lontong with a generous serving of spicy peanut sauce.\"\n\nOrigin:\nThe word 'lontong' originated from the Indonesian language, specifically from the Javanese dialect. It has been adopted into Singlish due to the cultural influence and close proximity between Singapore and Indonesia. \n\nNote:\nIn some Malaysian dialects, 'lontong' may also refer to a variation of the dish where the compressed rice cake is cooked in a banana leaf."}
{"word": "Roti", "description": "Title: Roti\n\nPronunciation: RO-tee\n\nAlternate spellings: Roti prata, Roti pratha\n\nDefinition:\nRoti, derived from Hindi language, refers to a type of unleavened Indian bread that is popular in Singapore and other parts of Southeast Asia. It is typically made from wheat flour, water, and occasionally clarified butter (ghee). The dough is stretched and flattened, then cooked on a hot griddle or pan until it becomes slightly crispy on the outside.\n\nIn Singapore, Roti is commonly enjoyed as a breakfast or snack option, often accompanied by a variety of savory or sweet accompaniments. The most popular variations are Roti Prata and Roti Pratha, which feature a flakier texture due to multiple layers of folded dough. These versions are usually served with curry or dhal, and can be customized with additions such as eggs, cheese, onions, or even chocolate.\n\nExample sentence:\n\"Let's go to the hawker center and have some Roti Prata with chicken curry for supper!\"\n\nNote:\nSinglish is a colloquial English creole spoken in Singapore. While 'Roti' itself is not exclusive to Singlish, it is widely used and understood in the local context. The pronunciation may vary slightly depending on the speaker's accent."}
{"word": "Mantou", "description": "Mantou\n\nPronunciation: mun-tow\n\nAlternate spellings: Manto, Man-tou\n\nDefinition:\nMantou refers to a popular Chinese steamed bun that is a staple in Singaporean cuisine. It is a fluffy, white, and doughy bun made from wheat flour, yeast, and water. Mantou is usually steamed until it becomes soft and slightly chewy. It is commonly enjoyed as a side dish or as a main course with various fillings, such as sweet red bean paste, savory meats, or vegetables.\n\nExample:\n\"I feel like having some mantou for breakfast; they go perfectly with hot soy milk.\"\n\nNote: Mantou is derived from the Chinese language and is widely understood and used in the local Singlish dialect."}
{"word": "Mee chiang kueh", "description": "Mee chiang kueh (pronounced \\mi-chahng-kwey\\), also known as Apam Balik or Min Chiang Kueh, is a popular and beloved Singaporean snack. This term originated from the Hokkien Chinese dialect and is used to describe a traditional pancake-like dessert.\n\nAlternate spellings: Mee Chiang Kueh, Apam Balik, Min Chiang Kueh\n\nDefinition: Mee chiang kueh refers to a thick, fluffy pancake typically filled with a sweet or savory filling. The pancake is made from a batter consisting of plain flour, sugar, water, and sometimes a pinch of salt. Fillings can vary and typically include options like ground peanuts, sweet corn, red bean paste, or a combination of these ingredients.\n\nUsage: Mee chiang kueh is a popular snack often enjoyed during breakfast or as a tea-time treat. It is usually cooked on a round, flat griddle and folded in half after the batter has cooked on one side. The result is a soft and slightly crispy pancake filled with a delicious filling.\n\nExample:\n\"Let's go to the hawker center and get some mee chiang kueh for breakfast. I love the one with peanut filling!\"\n\nNote: Singlish, a unique variety of English spoken in Singapore, often incorporates words and phrases from various languages, including Malay, Chinese dialects like Hokkien, and Tamil. Mee chiang kueh is one such example of a term commonly used in Singlish conversations."}
{"word": "Maggi", "description": "Maggi (mah-gee) – Alternate Spelling: Maggie\n\nDefinition: \n\n1. Noun: A popular brand of instant noodles that originated in Malaysia, characterized by its distinctive yellow packaging and wide range of flavors. Maggi instant noodles are a staple in Singlish cuisine and are often enjoyed as a quick and convenient meal or snack.\n\n2. Noun: Used colloquially, \"Maggi\" can also refer to any instant noodle dish or meal made using Maggi instant noodles, regardless of the brand.\n\nUsage:\n1. \"I'm feeling hungry, let's go to the hawker center and grab some Maggi mee.\"\n2. \"After a long day at work, all I want is a comforting bowl of Maggi.\"\n3. \"My favorite way to enjoy Maggi is by adding an egg and some veggies for added flavor.\"\n\nNote: The word \"Maggi\" is derived from the brand name \"Maggi\" itself, which is a well-known brand of instant noodles in Singapore and many other countries."}
{"word": "Nasi", "description": "Nasi (pronounced nah-see) refers to cooked rice in Singlish (Singaporean English). It is derived from the Malay language, where it simply means \"rice.\" Nasi is a staple food in Singaporean and Malay cuisine and often serves as the main component of various culinary dishes.\n\nAlternate spellings for 'Nasi' include \"Nasai\" or \"Nasi Lemak.\""}
{"word": "Pau", "description": "Word: Pau\nPronunciation: pao\nAlternate spellings: Pow, Pauh\n\nDefinition:\n1. Noun: A type of steamed or baked bun with a soft and fluffy texture, typically filled with savory ingredients such as barbecued pork, chicken curry, or vegetables. Paus are a popular snack or breakfast item in Singapore.\n   Example: \"Let's go to the hawker center and have some delicious char siu pau for lunch!\"\n\n2. Noun: Short form of \"paus\" or \"pausing\".\n   Example: \"Sorry, I'm in a pau right now. Can we continue the conversation later?\"\n\n3. Verb: Short form of \"pausing\" or \"paused\". This term is commonly used in online gaming or chatting.\n   Example: \"Hold on, I need to pau the game and grab a drink.\"\n\n4. Adjective: Used to describe a state of being amused or entertained.\n   Example: \"That joke you told was so funny, I was pau until my stomach hurt!\"\n\nNote:\nThe word \"pau\" is derived from the Hokkien and Teochew dialects, which are commonly spoken by the Chinese community in Singapore and other Southeast Asian countries."}
{"word": "Peng", "description": "Word: Peng\n\nPronunciation: pɛŋ\n\nAlternate Spellings: -\n\nDefinition:\nPeng is a popular Singlish slang term used to describe something or someone who is stylish, cool, attractive, or impressive. It is commonly used by Singaporeans, especially among the younger generation, to compliment someone's appearance, fashion sense, or overall demeanor. The word is often used in a positive and enthusiastic manner to convey admiration or approval.\n\nExample Usage:\n1. \"Wow, your new outfit is so peng!\"\n2. \"He's got a peng haircut that suits him perfectly.\"\n3. \"That car is super peng! Look at those sleek lines.\"\n\nNote: This term is predominantly used in informal settings and may not be widely understood outside of Singapore."}
{"word": "popiah", "description": "Popiah \n\nPronunciation: poh-pee-ah \n\nAlternate spellings: popia, pohpia \n\nDefinition:\nPopiah is a popular Asian delicacy commonly found in Singapore, Malaysia, and Taiwan. It is a type of spring roll that consists of a thin pancake-like wrapper filled with various ingredients and then rolled up. The filling typically includes julienned vegetables, such as turnips, carrots, and lettuce, along with bean sprouts, tofu, and sometimes shrimp or minced pork. Additionally, it is often accompanied by a sweet and savory sauce made from soybean paste. \n\nExample:\n\"My family enjoys making popiah during festive gatherings - it's a delicious and healthy snack!\"\n\nDid you find this definition helpful?"}
{"word": "potong", "description": "potong - /po-tong/ \n\nAlternate spellings: potong, potong\n\nDefinition:\nPotong is a common Singlish slang term derived from Malay, meaning \"to cut\" or \"to shorten.\" This term is often used to describe the act of cutting queue or taking a shortcut without permission, especially in a purposeful manner. Potong can also be used figuratively to express a sense of annoyance or dissatisfaction towards someone or something.\n\nExample:\n1. \"Don't potong my queue lah, I was here first!\"\n2. \"The bus driver potong our journey by taking a shortcut through the small roads.\"\n\nNote: \nPotong can also be used to refer to the act of cutting or trimming something physically, such as cutting hair or pruning plants. Additionally, it can be used metaphorically to describe someone interrupting or putting a stop to someone else's actions."}
{"word": "Putu mayam", "description": "Entry: Putu mayam\n\nPronunciation: Poo-too mah-yahm\n\nAlternate Spellings: Puttu maavu, Putoh myum\n\nDefinition:\nPutu mayam is a traditional South Indian dessert made from rice flour, grated coconut, and jaggery syrup. It is popular in Singapore and is commonly served as a sweet treat during breakfast or as a snack. The dish consists of thin strands of steamed or pressured-cooked rice noodles, often served with a side of coconut chutney. Putu mayam has a slightly sweet and fragrant taste, and the texture is soft and fluffy.\n\nUsage:\n1. \"Let's have some putu mayam for breakfast, it's so delicious!\"\n2. \"I'll bring some putu mayam as a dessert for the potluck.\"\n\nNote: Putu mayam can also refer to a savory version where the noodles are mixed with spices and served with a curry or vegetable side dish."}
{"word": "rojak", "description": "Title: Rojak (pronounced roh-jahk)\n\nMeaning:\nRojak is a popular term in Singlish, referring to a unique and diverse mixture or combination of ingredients. In the local culinary context, rojak typically refers to a dish that brings together various fruits, vegetables, and other ingredients, usually coated with a sweet and spicy sauce. However, the term 'rojak' is also used metaphorically in Singlish to describe a situation or arrangement of things that is a hodgepodge or mishmash.\n\nExample Sentences:\n1. \"Let's grab some rojak at the hawker center. I've been craving the sweet and spicy flavors.\"\n2. \"Our family gathering was a real rojak. Relatives from different parts of the world came together, bringing diverse cultures and traditions.\"\n\nAlternate Spellings:\nNo significant alternate spellings are commonly used for 'rojak'.\n\nNote: 'Rojak' is derived from the Malay language, where it refers to a traditional salad-like dish. Its usage in Singlish has expanded to encompass a broader meaning beyond its culinary origins."}
{"word": "Roti prata", "description": "Title: Roti Prata\n\nPronunciation: roh-tee prah-tah\n\nAlternate spellings: Roti pratha, Roti pratek\n\nDefinition:\nRoti Prata is a popular Singaporean dish that originated from Indian cuisine. It is a type of unleavened flatbread commonly served as breakfast or a snack. The word \"roti\" in Hindi means bread, while \"prata\" is derived from the Sanskrit word \"pratah\" meaning morning. The dish is also known by its English translation, \"Indian pancake\" or simply \"prata\".\n\nDescription:\nRoti Prata is made by kneading dough with ghee (clarified butter), water, and flour. The dough is then stretched, folded, and flattened into a thin circular shape. Traditionally, the dough is flipped and stretched dynamically to create layers, resulting in a flaky texture when cooked.\n\nTo prepare Roti Prata, the flattened dough is cooked on a hot greased griddle or pan until it turns golden and slightly crispy. It is usually served with a side of curry, which can be either vegetarian or non-vegetarian, and sometimes accompanied by fish or chicken curry.\n\nVariations of Roti Prata can also include additional ingredients like eggs, cheese, onion, garlic, or even sweet fillings such as banana or chocolate.\n\nThis delicious dish is a popular choice for breakfast or a quick bite among Singaporeans of all ethnicities and can be found in hawker centers, food courts, and Indian restaurants throughout the country.\n\nExample usage:\n\"I love having a hot plate of roti prata with a side of fish curry for breakfast.\"\n\n\"I want to try the roti pratha with cheese and onion filling this time!\"\n\n\"Let's go to the hawker center and have some crispy roti pratek for supper.\""}
{"word": "Satay", "description": "Entry: Satay\n\nPronunciation: suh-tay\n\nAlternate spellings: sate (less commonly used)\n\nDefinition:\nSatay refers to a traditional Southeast Asian dish consisting of skewered and grilled meat, typically served with a savory peanut sauce. This popular street food is commonly found in Singapore and Malaysia.\n\nExample usage:\n1. \"Let's go to the hawker center and eat some satay for dinner!\"\n2. \"I love the smoky aroma of satay when it's being grilled.\"\n\nNote: The word 'satay' is commonly used in English conversations in Singapore to refer to the dish."}
{"word": "sotong", "description": "Dictionary Entry:\n\nWord: Sotong\n\nPronunciation: soh-tong\n\nAlternate Spellings: None\n\nDefinition:\nSotong is a Singlish slang term derived from the Malay language, specifically meaning \"squid\". However, in Singlish, the word 'sotong' is commonly used as a playful and light-hearted way to describe someone who is absent-minded, clueless, or forgetful. It is used to tease or mock someone in a friendly manner, emphasizing a lack of awareness or foolishness. \n\nExample:\nAhmed: \"Hey, do you remember where we parked the car?\"\nRaj: \"Eh, you sotong ah? We parked it at level three!\"\n\nNote: This word is often used with humor and should be used with caution to avoid causing offense or disrespect. It is important to consider the context and relationship with the person when using this term."}
{"word": "Susu", "description": "Word: Susu\n\nPronunciation: soo-soo\n\nAlternate spellings: None\n\nDefinition:\nSusu is a colloquial term commonly used in Singlish, derived from the Malay language. It is used to refer to milk or any dairy-based product. The word is often used in informal conversations among locals in Singapore.\n\nExample sentences:\n1. \"Can you buy some susu from the supermarket?\"\n2. \"I love having a glass of susu with my breakfast every day.\"\n3. \"My son is allergic to susu, so we have to be careful with his diet.\"\n\nNote: In Singlish, speakers often use the word \"susu\" to refer specifically to milk. It is important to note that \"susu\" can also be used in the Malay language in its original context to refer to milk."}
{"word": "Tau huey", "description": "Tau huey \n\nPronunciation: [tow-hway]\n\nAlternate spellings: \n\n- Tau huay\n- Tau fu fa\n- Tau foo fa\n\nDefinition: \n\nTau huey, also known as tau huay, tau fu fa, or tau foo fa, is a popular dessert in Singapore that consists of silken tofu pudding served with a sweet syrup. The dish is a staple in local hawker centers and is often enjoyed as a refreshing treat during hot weather.\n\nThe term \"tau huey\" is derived from the Hokkien dialect, where \"tau\" means soybean and \"huey\" refers to water. The dish is made by coagulating soy milk with a natural coagulant, usually gypsum powder, resulting in a smooth and delicate tofu texture.\n\nTau huey is typically served warm or chilled and can be enjoyed either plain or with the addition of various toppings such as red bean paste, grass jelly, or chewy pearls. The dessert is highly regarded for its comforting and light taste, making it a popular choice among locals and visitors alike.\n\nExample:\n\n\"Let's go grab some tau huey for dessert after dinner.\"\n\n\"I love the silky texture of tau huey with a drizzle of gula melaka syrup.\"\n\nNote: Singlish is a creole language influenced by Malay, Chinese dialects, Tamil, and English. Its vocabulary and pronunciation may vary across different speakers and regions."}
{"word": "Tau huey zui", "description": "Entry: Tau huey zui \nPronunciation: /tao hoo-ay z-ee/ \n\nDefinition:\nTau huey zui is a colloquial Singlish term derived from the Hokkien language, commonly used in Singapore. It is typically used to describe someone who loves or has a strong craving for 'tau huey,' which is a popular traditional Chinese dessert made from soft beancurd and sweet syrup. Literally translating to \"beancurd drunkard,\" tau huey zui refers to a person who is obsessed with or highly enthusiastic about eating beancurd. \n\nAlternate spellings: \n- Tau huay zui \n\nExample:\nAh Beng: Eh, you see Ah Huat, he always go to the hawker center to eat tau huey. He is a tau huey zui, lah!\nAh Lian: Ya, sia! He cannot resist beancurd, like a tau huey zui. So funny! \n\nNote: Singlish is an informal and dynamic language, and its spellings and pronunciations may vary based on individual preferences and phonetic approximations."}
{"word": "Teh", "description": "Word: Teh\n\nPronunciation: teh\n\nAlternate spellings: \n\n1. Tea (conventional spelling)\n\nDefinition:\nTeh is a term commonly used in Singlish to refer to tea, specifically teh tarik, a popular milk tea found in Southeast Asia. The word 'teh' is borrowed from Hokkien, a Chinese dialect widely spoken in Singapore, Malaysia, and parts of Indonesia. This term has become an integral part of the Singlish vocabulary and is used to order a hot cup of milk tea, often with condensed milk and strong tea leaves.\n\nExample:\n\"I'll have a teh peng, please.\" (I would like a iced tea with milk, please)\n\nNote: Teh is often used as part of other Singlish terms such as teh-o (tea without milk) and teh-c (tea with evaporated milk) to specify the type of tea desired."}
{"word": "tofu", "description": "tofu [toh-foo]\nAlternate spelling: tau fu\n\nDescription:\nTofu refers to a popular food item commonly used in various Asian cuisines, especially in Singapore. It is a soybean-based product, also known as bean curd. Tofu has a soft, silky texture and a mild taste that allows it to absorb the flavors of other ingredients when cooked. It is a versatile ingredient and can be used in a multitude of dishes, such as stir-fries, soups, salads, and even desserts. Tofu is considered a healthy protein source and is often preferred by vegetarians and vegans.\n\nExample sentences:\n1. \"Let's have some stir-fried tofu for dinner tonight.\"\n2. \"Have you tried the spicy tofu soup at the hawker center? It's amazing!\"\n\nNote: Singlish often adopts words from different languages and cultures, resulting in alternative spellings or pronunciations. Thus, 'tofu' is sometimes spelled as 'tau fu' in Singapore."}
{"word": "Tzap", "description": "Entry: Tzap\n\nPronunciation: /tsap/ \n\nAlternate spellings: Tzarap, Zaap\n\nDefinition: \n\nTzap is a widely used Singlish term that originated from the Hokkien dialect. It is primarily used to describe the act of abruptly leaving or disappearing from a gathering or social event without notifying others. The term carries a sense of suddenness and spontaneity, often leaving those remaining behind feeling surprised or puzzled.\n\nExample sentences:\n\n1. \"Hey, where did John go? He just tzapped without saying goodbye!\"\n2. \"I can't believe she tzapped in the middle of the movie. We were all wondering where she went.\"\n\nUsage and Cultural Significance:\n\nThe concept of tzapping stems from the cultural inclination towards maintaining harmony and avoiding confrontation or awkwardness. Tzapping is seen as a somewhat unconventional yet acceptable way of exiting situations that one deems uncomfortable or uninteresting, without causing inconvenience to others.\n\nWhile tzapping is not always viewed negatively, it can be perceived as rude or inconsiderate, especially when it is done without any explanation or legitimate reason. It is important to note that tzapping is widely utilized in social circles in Singapore and is understood among locals, but it may be unfamiliar to visitors or those not familiar with Singlish.\n\nIt is worth mentioning that there may be variations in spelling or pronunciations of the term, such as Tzarap or Zaap. Such variations depend on individual accents or regional dialect influences.\n\nOverall, the term tzap has become an expressive part of Singlish vocabulary, embodying the uniquely Singaporean way of navigating social situations while maintaining a certain level of autonomy and flexibility."}
{"word": "Yong tau foo", "description": "Yong tau foo (yong t-ow foo) - also spelled as yong tau hoo, yong tau fu, or yong tau fu - is a popular Hakka Chinese dish commonly found in Singapore and Malaysia. It is a type of meal made up of a variety of fresh ingredients such as tofu, fish balls, vegetables, meat, or seafood.\n\nPronounced as \"yong t-ow foo,\" this term originates from the Hokkien and Cantonese dialects, with \"yong\" meaning \"tofu\" and \"tau foo\" or \"tau fu\" meaning \"bean curd.\" In Singlish, the term is widely accepted and understood due to the significant Chinese influence on the local language.\n\nYong tau foo is traditionally prepared by stuffing the ingredients with a fish or meat paste mixture, which is then deep-fried or boiled. These stuffed ingredients are then served with steamed rice or noodles, accompanied by a flavorful broth or sauce.\n\nHowever, in modern times, yong tau foo has also evolved to include a self-service concept. In this variation, customers can choose their preferred ingredients from a selection of already stuffed or unfilled items, which are then cooked in boiling broth upon order.\n\nThe versatility of yong tau foo allows individuals to personalize their meals, making it a popular choice for many locals. The dish is often accompanied by a variety of condiments, such as chili sauce, sweet sauce, or soy sauce. It satisfies both meat lovers and vegetarians alike, making it a beloved comfort food in Singaporean and Malaysian cuisine."}
